{"facts": ["[technical] Foundations '25 Data Science › Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th) › Week 3 Overview : Week 3 Overview Welcome to the first week of foundations. We're super excited to be working with/learning from all of you. While this is only the first week of the pre-program, we encourage you to start considering which projects you'd like to complete, and which roles you'd like to apply for during this fellowship. If you've considered these thoughts before, great! Let us know what's on your mind so that we can make the most of this program and provide you with the resources necessary for your definition of success. If you haven't considered these questions before, now is a perfect time to start", "[technical] Foundations '25 Data Science › Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th) › Week 3 Overview : . This week, we will help shape this line of thinking by: Going over the historical underpinnings of data science. Describing the \"necessity\" of data science. Describing the prospects of data science. Previewing all incoming content and schedule. Describing the pattern of each week. Introducing you to the Python programming language. Here’s an overview of what’s ahead this week: W3D3: Introduction to Data Science W3D4: First Steps in Programming © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th) › W3D3: Introduction to Data Science: Introduction to Data Science Before Class Please check out the following resources: Think Python: Ch1 Purpose: A light introduction to Python. What Does a Data Scientist Do? Purpose : A light introduction to data science in enterprise. First Convolutional Neural Net Purpose: A video from 1993 to show how far back \"data science\" reaches. Verify that you can access VSCode Edu Purpose: Prepare for this weeks modules. Estimated time to complete : 2-3 hours During Class Learning Objectives Understand the syllabus & schedule, as well as class pattern Discover the state and history of data science Get started in creating your first Python program Implement basic user interactions using the input function Resources Slides - Introduction to Data Science Think Python: Ch1 VSCode Course Unit 1 : Lesson 1 - Lesson 2 After Class Please complete the following tasks after class: [Discussion] What do you want to use data science for? Zoom Recording https://theknowledgehouse-org.zoom.us/rec/share/5RqmYP-91DT6qGRvcqLaBmbjN-FRZue82UASC-HmwrSjctwjkEb_IICqiCQgr_Qp.VrtbYghCtHNTFSaa?startTime=1739399462000 Passcode : 5Q8eZ!?# © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th) › W3D4:  First Steps in Programming: First Steps in Programming Before Class Now that we understand which tools are necessary to implement comprehensive data science projects, we will continue our review of the Python programming language. We will deepen our understanding of the operations necessary to perform fundamental data transformations. Think Python: Ch2 Purpose: A light introduction to Python. Verify that you can access VSCode Edu Purpose: Prepare for this weeks modules. During Class Learning Objectives Understand data types Implement maths and respective variables in Python Understand program tracing Resources Slides - First Steps in Programming Think Python: Ch2 VSCode Course Unit 1 : Lesson 1 - Lesson 8 After Class Please complete the following tasks: [TEX] W3D4 Programming Quiz Zoom Recording https://theknowledgehouse-org.zoom.us/rec/share/MfJzOBuyAQuDCBc3Xto98WA525ryWRgf8nJPtEz0c6YKFFiXcx4sQt0Izi9qqGAM.FNq1dBvJ62yuphHE?startTime=1739485811000 Passcode : pq!1UZV6 © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th) › [Discussion] W3D3 What do you want to use data science for? (Discussion)", "[technical] Foundations '25 Data Science › Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th) › [TEX] W3D4 Programming Quiz  (Assignment)", "[technical] Foundations '25 Data Science › Week 4: Advanced Programming (Feb. 17th- Feb. 20th) › Week 4 Overview  : Week 4 Overview Welcome to week 2! Now that we have a comprehensive understanding of what it takes to be a data scientist, let's dig deeper and strengthen our fundamental understanding of Python. While we have been introduced to the most basic concepts in Python, our next task is to understand: strings and their respective operations how to read errors, how to import modules, how to create and append to lists, how to define and use functions, and how to read graphs Here’s an overview of what’s ahead this week: W4D2: Introduction to Programming W4D3: Introduction to Functions W4D4: Advanced Functions © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 4: Advanced Programming (Feb. 17th- Feb. 20th) › W4D2: Introduction to Programming: Introduction to Programming Before Class Please engage with the following resources: Think Python: Ch8 (8.1 - 8.3) Purpose : Get introduced to the concept of a string. During Class Learning Objectives Understand execution order, Learn how to import modules, Create and manipulate strings Resources Slides - Introduction to Programming Think Python: Ch8 (8.1 - 8.3) VSCode Course Unit 1 : Lesson 1 - Lesson 8 VSCode Course Unit 1 : Lesson 9 - Lesson 14 (if 1-8 complete) After Class Please complete the following tasks: W4D2 Introduction to Programming Quiz © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 4: Advanced Programming (Feb. 17th- Feb. 20th) › W4D3: Introduction to Functions: Introduction to Functions Before Class Please engage with the following resources: Think Python: Ch9 (9.1 - 9.5) Purpose: Get introduced to the concept of data structures. Think Python: Ch4 (3.1 - 3.3; 3.5-3.8) Purpose: Get introduced to the concept of creating a function. During Class Learning Objectives Errors Using built-in functions, Arguments, Defining a Function Lists Resources Slides - Introduction to Functions Think Python: Ch4 (3.1 - 3.3) Think Python: Ch9 (9.1 - 9.5) VSCode Course Unit 1 : Lesson 9 - Lesson 14 VSCode Course Unit 2: Lesson 1 - Lesson 3; Unit 4 Lesson 4 - Lesson 5 (if 9-14 complete) After Class Please complete the following tasks: W4D3 Introduction to Functions Quiz © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 4: Advanced Programming (Feb. 17th- Feb. 20th) › W4D4: Introduction to Functions II: Introduction to Functions II Before Class Please engage with the following resources: Think Python: Ch9 (9.1 - 9.5) Purpose: Get introduced to the concept of data structures. Think Python: Ch4 (3.1 - 3.3; 3.5-3.8) Purpose: Get introduced to the concept of creating a function. During Class Learning Objectives Defining a Function Lists Resources Slides - Introduction to Functions Think Python: Ch4 (3.1 - 3.3) Think Python: Ch9 (9.1 - 9.5) VSCode Course Unit 1 : Lesson 9 - Lesson 14 VSCode Course Unit 2: Lesson 1 - Lesson 3; Unit 4 Lesson 4 - Lesson 5 (if 9-14 complete) After Class Please complete the following tasks: W4D3 Introduction to Functions Quiz © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 4: Advanced Programming (Feb. 17th- Feb. 20th) › [TEX] W4D2 Introduction to Programming Quiz (Assignment)", "[technical] Foundations '25 Data Science › Week 4: Advanced Programming (Feb. 17th- Feb. 20th) › [TEX] W4D3 Introduction to Functions Quiz (Assignment)", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › Week 5 Overview   : Week 5 Overview Welcome to statistics week! This week will entail a bit of a departure from our typical coding exercises. Instead, we will explore the mathematics necessary to discuss data and the predictions we can extract from our data. Here’s an overview of what’s ahead this week: W5D1: Advanced Functions W5D2: Types of Experiments & Visualizing Data W5D3: Descriptive Statistics & Probability W5D4: Intro to Data Analytics and Machine Learning © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › W5D1:  Advanced Functions: Advanced Functions Before Class Please engage with the following resources: Think Python Ch5 (5.1 - 5.7) Links to an external site. Purpose: Learn about the different types of conditionals in Python. Think Python Ch6 (6.1 - 6.3) Links to an external site. Purpose: Review Python functions. During Class Learning Objectives Understand function scope Learn best practices when debugging functions Learn about foundational control flow Resources Slides - Advanced Functions Think Python: Ch6 (6.1 - 6.3) VSCode Course Unit 2 : Lesson 4 - Lesson 8 After Class Please complete the following tasks: W5D1 Advanced Functions Quiz © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › W5D2: Types of Experiments & Visualizing Data: Types of Experiments & Visualizing Data Before Class Please engage with the following resources: Experiments Explained: Clear and Simple! Learn the Basics Purpose: Learn about the basic terminology used when designing an experiment/interpreting data. wpDataTables - Different Types of Graphs Purpose: Learn about the different types of graphs. During Class Learning Objectives Understand how we set up scientific experiments Interpret different types of variables Understand which visualizations to choose for your analysis Learn how to make visualizations in Python Resources Slides - Types of Experiments & Data Visualizations Kaggle - Data Visualization (Lessons 1 - 4) After Class Please complete the following tasks: W5D2 Experiments & Visualizations Quiz © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › W5D3: Descriptive Statistics & Probability: Descriptive Statistics & Probability Before Class Please engage with the following resources: Measures of Central Tendency Purpose: Understand measures of central tendency and the differences between them Probability Primer (up to page 3) Purpose: Get introduced to fundamental probability equations. During Class Learning Objectives Understand the basics of describing a dataset Discover the relationship between descriptive statistics and the normal distribution Understand the basics of probability Resources Slides - Descriptive Statistics & Probability Kaggle - Data Visualization (Lessons 4 - 8) After Class Please complete the following tasks: W5D3 Descriptive Statistics & Probability © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › W5D4: Intro to Data Analytics & Machine Learning: Intro to Data Analytics & Machine Learning Before Class Please engage with the following resources: Exploratory Data Analysis Purpose : Get introduced to the process of EDA. The Main Ideas Behind Probability Distributions Purpose: Learn about the process of calculating a probability distribution. Central Limit Theorem, Clearly Explained Purpose: Understand the importance of CLT. Types of Statistical Distributions in ML Purpose: Learn about the different types of distributions in machine learning. During Class Learning Objectives Review the analytical process Understand both univariate & bivariate visualizations Understand the importance EDA Interpret probability distributions Identify the importance of the central limit theorem Resources Slides - Intro to Data Analytics & Machine Learning Kaggle - Intro to Machine Learning (Lessons 1-2) After Class Please complete the following tasks: Final Quiz © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › [TEX] W5D1 Advanced Functions Quiz (Assignment)", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › [TEX] W5D2 Types of Experiments & Visualizing Data Quiz (Assignment)", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › [TEX] W5D3 Descriptive Statistics & Probability Quiz  (Assignment)", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: Image from https://publicdomainreview.org/essay/notes-on-the-fourth-dimension Data Science is the practice of informing decisions and generating predictions using a rich set of historical and current data. This concept is by no means new and even could be thought of as simply an extension of human nature. We can't help but recognize patterns , but how can we ensure that the patterns that we notice are grounded in reality ? The term rich dataset indicates that your data is highly descriptive , and captures multiple dimensions of a sample. For example, if you are collecting data on cups of coffee, one individual cup of coffee would be a sample", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . A rich dataset would include bean type, protein, caffeine concentration, origin, roast, and more. To demonstrate an example of data science in action, let's consider a somewhat ridiculous thought experiment: You begin commuting every day at around 8 AM on the weekdays. One day during your commute, you notice a crow perched on top of a park bench. In its beak is a $5 bill . You think of a brilliant solution and pull out a granola bar from your bag that you were saving for later and place it open next to the crow. The crow releases the $5 bill and goes for the granola bar. You grab the $5. Yo u have somehow managed to profit from this seemingly random event", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . By the next day, the memory of this event has already lost its significance to you, and you are once again on your way to work. To your surprise, you see the crow once more, but this time it has a crisp $20 bill. Following the same logic as yesterday, you reach inside your bag for a granola bar, but this time you only find loose cashews. You place the cashews by the crow's side and it reciprocates by releasing the $20. You seem to have formed an aviary trade alliance. You begin your commute the next day again, this time anticipating the crow's presence. Just like yesterday, you see the crow but this time it holds a measly $1 bill", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . And just like yesterday, you feed it the cashews that have been bouncing around your bag. What do you think compelled the crow to alter its cash gift? This question is bouncing around your mind during the entire day until you come home and draft an experiment on paper: \" Carry two types of snack each day: cashews & granola bars. Record $$$ given from crow, along with the snack that I provided yesterday. Try to find pattern.\" A dataset is simply a collection of observations , which can be quantitative or qualitative. You conduct this experiment over a week and draft your observations in the following dataset: Day 1 Day 2 Day 3 Day 4 Day 5 Day 6 Day 7 Crow Amount $1 $10 $20 $5 $5 $50 $1 Food Provided Yesterday cashews granola bar granola bar cashews cashews granola bar cashews You might notice a pattern arising from this experiment", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . Data science is the ability to formalize and use this pattern through mathematics and computation . In the sections below, we will explore some light theorems and definitions that will help us discuss these relationships mathematically. But, before we call it a wrap and buy bulk boxes of granola bars, we must ask ourselves a few questions that all data scientists should consider: How can you be sure that this wasn't caused due to random chance ? What would be a value that represents the typical amount received from this crow? Have we conducted this experiment long enough ? What should our next steps be to maximize profit ? And lastly..", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . Where is this crow getting all this money from? Are we harming anyone with this practice? If not, does this crow have any friends ? Consider the following question, what is the difference between data & information ? When does data become information? While this example is far removed from our reality, the questions we ask ourselves at the end of this experiment are the typical thoughts of a data scientist. Let's consider some real-life applications of data science that have been used in today's world: The NBA Data Scientist Marriott: Data-driven Customer Experience for Decades at Scale Credit Card Scoring & Modeling For this course, we will delve into real, interesting , and actionable datasets", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . For the time being, however, let's progress with this crow example while reaffirming a few mathematical concepts. We mentioned a couple of questions that we should ask ourselves after this experiment. One of those questions considers the typical amount we receive from the crow. How is \"typicality\" measured in data analytics? Thankfully, we have a couple of basic definitions that we can utilize: Average: Calculated by diving the sum of values by the \"size\" of the dataset. Also known as \"mean.\" Median: Calculated by arranging values in ascending order, and finding the \"central\" number. Mode: Calculated by noticing the number that appears the most often", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . To better describe these definitions, let's calculate these metrics on our present dataset. Average First, I will calculate the sum of this dataset. Next, I will take this value and divide it by the number of observations I have to calculate the average. The typical dollar amount that I get from this crow is $13.14. Median To calculate the median, I will first arrange all numbers in ascending order Next, I will iteratively cross off values from the left and right of my list until I am down to just 1 number. If I am left with 0 numbers after crossing out equal amounts on either side, I will take the average of the middle two values to generate my median", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . As can be observed, my median is 5. Mode Lastly, I can likewise observe the values that appear most frequently in my dataset. In this case, I have a tie between $1 and $5, so I state that my mode is: Notice how our mean is more than our median and mode . This is a relevant observation that we will discuss further in the rest of the course. We call these terms, measures of central tendency . By employing these simple measures, we can actually \"predict\" what a typical value will look like! The most interesting observation we can make from this dataset is when we split our dataset into \"cashew\" and \"granola\" groups", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . Cashew Group Day 1 Day 4 Day 5 Day 7 Crow Amount $1 $5 $5 $1 Food Provided Yesterday cashews cashews cashews cashews Granola Group Day 2 Day 3 Day 6 Crow Amount $10 $20 $50 Food Provided Yesterday granola bar granola bar granola bar Compute the average for these separate datasets. Do you notice a difference in value for these two averages ? Why might this be ? Granola group is also the scientific term for a group of people that hike a lot. In the next section, we will take this experiment to another level once we find out that these crows are a rare super-crow that recently escaped government confinement", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . After coming home from another work-day and crow trading, you get a news notification on your phone: SUPER-INTELLIGENT CROW SPECIES ON THE LOOSE IN (your city). DISCOVERED RUNNING A DROP-SHIPPING COMPANY. WHAT ARE THEY USING THEIR PROFITS FOR? You quickly get on \"reddit.com\" and find an entire community dedicated to giving cashews to various crows perched on park benches in exchange for cold hard cash. Not only that, but each forum user has also been collecting their observations on the average value that crows assign to cashews. You gather 30 samples of average cash gifts when giving cashews from all these users, and organize a new dataset: Interestingly enough, the average cash gift we received when feeding our crow was $3", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . This number appears pretty frequently in the data that we've observed ! A sample is a small representation of a larger group. It could contain one object or multiple. A population is the entire set from which you draw your samples. For example, the US Census only takes a sample of 3.5 million addresses, whereas the population of addresses is roughly 165 million . To better visualize this, we could create something called a probability distribution . A probability distribution is simply a graph that represents the frequency of a value in a dataset as expressed by probability . For now, we will classify probability as the likelihood of something occurring from 0% to 100%", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . We read a probability distribution graph by observing where the curve is located on the y-axis when considering various x-values. This corresponding y-value is the probability of this value occurring in our dataset. For example, an x-value of 8 results in a y-value of 0.025 ( aka 2.5% ). an x-value of 6 results in a y-value of 0.100 ( aka 10% ). In total, all these y-values must add up to a value of 1.00 ( aka 100 %). To view how this curve was generated in Python, click on the following link . What x-value has the highest probability in this curve? Before observing the answer below, try answering this question yourself", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . We can see that the most frequent value of this dataset is slightly above 4 . Is it any coincidence then that we have an average cashew value of 3, a value which is just hovering below the typical average ? This \"bell curve\" that presents rare extreme values, and frequent typical values is not a coincidence ! We will see this very behavior pop up in many real-world phenomena. This practice of observing the full breadth of data in this hypothetical scenario is once again a reflection of the challenges a data scientist is tasked with solving. Consider the situation: You have come across a seemingly random event You have managed to profit off of this event (multiple times!) You discover that many other individuals are experiencing your reality and taking similar actions Now that you understand that this exchange is not simply a random occurrence, but instead, a patterned and frequent occurrence, what next steps could you take? Consider the fact that you tried a variation on your technique by giving granola bars instead of cashews", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . This has not yet been tried by the Gestalt (collective society). How can you tell if this variation is truly giving you a profit advantage? Think of other real-world scenarios where companies might want to discover competitive advantages in some financial transaction . Consider the following question. You are feeding your crow's granola bars and getting large bills in return, whereas others are feeding cashews and getting slim pickings. Do you share this wealth of information? Why or why not? This concludes our discussion of this hypothetical world of super-intelligent birds. Although truthfully, animals might have more of an intrinsic understanding of value than we let on", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › What is Data Science?: . In the next section, we will go over the \"hierarchy of needs\" of a data scientist and the common workflows that we employ to address those needs. This course will be a mix of theoretical frameworks, as well as practical on-the-job applications that will allow you to be an effective and confident data scientist.", "[technical] Foundations '25 Data Science › Week 5:  Statistics(Feb. 24th- Feb. 27th) › [TEX] Final Quiz  (Assignment)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › Week 1 Overview: Week 1 Overview On behalf of the entire TKH team, congratulations on starting your journey with Foundations! We are thrilled to welcome you to the TKH community. This week marks the beginning of an exciting path where you'll develop essential skills and mindsets that will not only set you up for success in this program but also empower you in your career and personal growth. Together, we’ll embark on a journey to explore tools, strategies, and perspectives that will serve as the bedrock of your learning experience and professional development. Here’s an overview of what’s ahead this week: W1D1: Getting Started W1D2: Learning How to Learn W1D3: Building Your Inner Compass (Motivation and Emotional Strength) W1D4: The Productivity Toolkit © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D1: Getting Started: Getting Started: Classroom Tools and Support Before Class Prior to our first class session, reserve 1-2 hours to watch the videos, read the materials, and complete the assignments within this section. Watch: Read: Foundations Support Network & Slack Channel Guide Tips for Getting the Most Out of Each Class Session Tips for Engaging in Breakout Rooms Do: Ensure that you have completed all of the tasks associated with the W1D1 Before Class: Foundations Onboarding Checklist Test Your Knowledge by completing the following: W1D1 Before Class Mini Quiz: Foundations Onboarding Knowledge Check During Class Learning Objectives Understand the Foundations Roadmap Learners will review the roadmap and outline milestones for the next 5 weeks", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D1: Getting Started: . Define Success Criteria Learners will identify requirements to complete Foundations and qualify for the Innovation Fellowship. Use Virtual Classroom Tools Learners will collaborate in small groups to practice and demonstrate effective use of Zoom, Canvas, and Slack. Build a Support Network Learners will connect with peers, TKH team members, and learn to request support through TKH systems. Resources Foundations: Zoom Classroom Spreadsheet W1D1: Getting Started Slides (W1D1) Breakout Room Exercises After Class Please complete the following tasks by the specified deadlines: By Monday, February 3, 2025 Complete the assignment: (W1D1) After Class Assignment: Reflecting on Your Support System Before tomorrow's class complete all Pre-Session requirements outlined in the \"Before Class\" Section for W1D2 © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D2: Learning How to Learn: Learning How to Learn: Study Habits and Learning Strategies Before Class Today’s materials focus on building strong study habits, improving memory and focus, and becoming a self-directed learner. As you embark on your learning journey with TKH, these skills will be critical to your success. Please reserve 1–1.5 hours to review the materials and complete the assigned task prior to our class session. There are 9 videos in total, please be sure to watch all of them. Watch: Read: The Odin Project has some great resources for Asking Technical Questions . Throughout your time with TKH, we expect that learners follow similar practices when asking questions on Slack", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D2: Learning How to Learn: . Do: After you have watched all of the videos, complete the (W1D2) Before Class Mini Quiz: Learning How to Learn Knowledge Check During Class Learning Objectives Recognize common challenges when learning new material and identify practical strategies to overcome them. Identify and implement effective study habits that support consistent, productive learning routines. Define self-directed learning and growth mindset-evaluate their importance for skill development and career growth. Reflect on and assess personal learning preferences and styles to identify the most effective study methods. Develop a plan to incorporate memory and focus strategies into daily learning routines for improved performance over time", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D2: Learning How to Learn: . Resources Foundations: Zoom Classroom Spreadsheet W1D2: Learning How to Learn Slides (W1D2) Breakout Room Exercises After Class Please complete the following tasks by the specified deadlines: By Tuesday, February 4, 2025 Complete the assignment: (W1D2) After Class Assignment: Complete the VARK Questionnaire and Reflect on Your Learning Preferences Before tomorrow's class complete all Pre-Session requirements outlined in the \"Before Class\" Section for W1D3 © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D3: Building Your Inner Compass (Motivation and Emotional Strength): Building Your Inner Compass: Motivation and Emotional Strength Before Class Please reserve 1-2 hours prior to our class session to engage with the following resources and complete the Before Class Exercise: Watch: Read: The 2 Powerful Charisma Traits You Need To Enhance Your Leadership Do: And complete the following exercise prior to today’s class session: (W1D3) Before Class Exercise: Self Discovery Worksheet During Class Learning Objectives Define the Inner Compass: Understand the key elements that guide decision-making and growth. Align Values and Motivation: Reflect on personal values and motivations to make more intentional, authentic choices", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D3: Building Your Inner Compass (Motivation and Emotional Strength): . Navigate Challenges with Emotional Regulation and Compassion: Learn to manage emotions and extend compassion to yourself and others during setbacks. Strengthen Self-Advocacy and Decision-Making: Develop strategies for self-advocacy, setting boundaries, and making informed decisions. Resources Foundations: Zoom Classroom Spreadsheet W1D3: Building Your Inner Compass (W1D3) Breakout Room Exercises After Class Please complete the following tasks: Due by Wednesday, February 5, 2025, 11:59 pm (W1D3) After Class Assignment: Applying the DESC Model Before tomorrow's class complete all Pre-Session requirements outlined in the \"Before Class\" Section for W1D4 © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D4: The Productivity Toolkit: The Productivity Toolkit Before Class Please reserve 1 hour prior to our class session to engage with the following resources and complete the Before Class Exercise: Watch: Do: Prior to our class session complete (W1D4) Before Class Exercise: Write 3 SMART Goals During Class Learning Objectives Define what SMART goals are and explain each component (Specific, Measurable, Achievable, Relevant, Time-bound). Evaluate existing goals to determine if they meet SMART criteria and revise them as necessary. Understand the Eisenhower Matrix and how it categorizes tasks by urgency and importance. Develop a personal daily or weekly time-blocking schedule based on current priorities and responsibilities", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › W1D4: The Productivity Toolkit: . Reflect on how these tools can help maintain focus, reduce stress, and achieve long-term goals. Resources Foundations: Zoom Classroom Spreadsheet W1D4: The Productivity Toolkit Slides (W1D4) Breakout Room Exercises After Class Please complete the following tasks by the specified due dates: 1. By Monday, February 3rd, 2025 Respond to this anonymous, brief Weekly Exit Ticket 2. By Thursday, February 6th, 2025 at 11:59 pm Submit (W1D4) After-Class Assignment: Time Blocking and SMART Planning 3. Prior to our next class session Engage with materials outlined in the \"Before Class\" Section for W2D1 © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D1) Before Class Onboarding Checklist (Assignment)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D1) Before Class Mini Quiz: Foundations Onboarding Knowledge Check  (Quiz)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D1) After Class Assignment: Reflecting on Your Support System (Assignment)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D2) Before Class Mini Quiz: Learning How to Learn Knowledge Check  (Quiz)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D2) After Class Assignment: Complete the VARK Questionnaire and Reflect on Your Learning Preferences (Assignment)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D3) Before Class Exercise: Self Discovery Worksheet (Assignment)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D3) After Class Assignment: Applying the DESC Model (Assignment)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D4) Before Class Exercise: Write 3 SMART Goals  (Assignment)", "[technical] Foundations Course › Week 1: Foundations For Success (Jan. 27th-Jan. 30th) › (W1D4) After-Class Assignment: Time Blocking and SMART Planning (Assignment)", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › Week 2 Overview : Week 2 Overview This week is all about exploring the three tracks offered through the Innovation Fellowship: Cybersecurity Data Science Web Development Whether you enter Foundations with a clear preference or are still considering your options, this week is designed to help you dive deeper into each field and gain the knowledge needed to make an informed decision. Throughout the week, you will engage with resources, participate in hands-on mini-lessons, and connect with industry professionals who will share their career journeys. By the end of this week, you will have a better understanding of each track and the roles within them, helping you determine the path that best fits your interests and career goals", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › Week 2 Overview : . Here’s an overview of what’s ahead this week: W2D1: Paths and Possibilities W2D2: Track Exploration (Mini Lessons) W2D3: Track Exploration (Mini Lessons Continued) W2D4: Meet the Industry Experts ***************************************************************************************************************************************************** PLEASE BE ADVISED: Track Preference Survey – Time-Sensitive Requirement All Foundations participants must complete the Track Preference Survey after the Thursday, February 6th session . The survey will close on Friday, February 7th at 11:59 pm – you have just over 24 hours to submit your responses", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › Week 2 Overview : . This survey is mandatory for all fellows, regardless of location or track availability. It also includes questions about device compatibility and short-answer responses critical for your Fellowship preparation. Instructions Here : (W2D4) After Class Assignment: Track Preference Survey Be sure to reserve time to complete this important assignment within the window that it is open. This step is essential for all prospective IF Fellows— failure to complete the survey by Friday, February 7th at 11:59 pm (local time) may disqualify you from further consideration for admission. © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D1: Paths and Possibilities: Exploring the Tech Frontier: Paths and Possibilities Before Class Please reserve 45 minute s to watch the following videos, prior to class: There is no Before Class Assignment for today's session, however you will have the opportunity to connect with the Innovation Fellowship Instructional Team. Consider what questions you may have for them, or what you would like to know about each of the tracks. During Class Learning Objectives By the end of today's session you will be able to: Describe how technology is reshaping industries Summarize the core focus, key tools, and projects associated with each of the IF tracks Develop an understanding of entry-level roles associated with each track, as well as potential areas for future specialization Resources Foundations: Zoom Classroom Spreadsheet W2D1: Paths and Possibilities Slides There is no Breakout Room Activity for this session After Class Please complete the following tasks: (W2D1) After Class Assignment: Explore Your Preferred Track and Research Associated Roles Please Note: You do not need to submit anything at this time, however you are expected to complete this research by Friday, February 7th -as it will contribute to your Track Preference Survey response", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D1: Paths and Possibilities: . (W2D1) After Class Assignment: Prepare a Question for the Industry Panel Discussion Please Note: You do not need to submit anything at this time, however you are expected to p ost your question or upvote a peer’s question by Thursday, February 6th at 10:00 AM © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D2: Track Exploration (Track Mini Lessons) : Track Exploration: Track Mini Lessons Before Class If you are participating in the Data Science Mini Lesson today, please review this brief video prior to our class session. For fellows participating in other tracks' Mini Lessons there is no required pre-session videos. Additionally, all fellows are encouraged to independently explore resources, articles, or tutorials related to your track of interest to deepen your understanding and support your track exploration. Finally, PLEASE BE ADVISED: Track Preference Survey – Time-Sensitive Requirement All Foundations participants must complete the Track Preference Survey after the Thursday, February 6th session", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D2: Track Exploration (Track Mini Lessons) : . The survey will close on Friday, February 7th at 11:59 pm – you have just over 24 hours to submit your responses. This survey is mandatory for all fellows, regardless of location or track availability. It also includes questions about device compatibility and short-answer responses critical for your Fellowship preparation. Instructions Here : (W2D4) After Class Assignment: Track Preference Survey Be sure to reserve time to complete this important assignment within the window that it is open. This step is essential for all prospective IF Fellows— failure to complete the survey by Friday, February 7th at 11:59 pm (local time) may disqualify you from further consideration for admission", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D2: Track Exploration (Track Mini Lessons) : . During Class Learning Objectives By the end of today's class session, you will: Gain hands-on experience in one of our three tracks: Cybersecurity, Data Science, or Web Development . Explore core concepts, tools, and problem-solving approaches unique to the track through interactive activities. Reflect on your experience to strengthen your understanding of whether this track aligns with your interests, helping you feel confident in your track commitment. Resources Foundations: Zoom Classroom Spreadsheet Cyber Security \"Try-On\" Exercise Data Science \"Try-On\" Exercise Web Development \"Try-On\" Exercise After Class Please continue to work on the following tasks: During this week’s live sessions, you’ll participate in two out of three track-specific \"mini try-on exercises.\" If you’d like to get a taste of the remaining track on your own, you can complete its exercise asynchronously", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D2: Track Exploration (Track Mini Lessons) : . Simply locate the corresponding PDF in the \"During Class Resources\" section and follow the instructions. (W2D1) After Class Assignment: Explore Your Preferred Track and Research Associated Roles Please Note: You do not need to submit anything at this time, however you are expected to complete this research by Friday, February 7th -as it will contribute to your Track Preference Survey response. (W2D1) After Class Assignment: Prepare a Question for the Industry Panel Discussion Please Note: You do not need to submit anything at this time, however you are expected to p ost your question or upvote a peer’s question by Thursday, February 6th at 10:00 AM © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D3: Track Exploration (Track Mini Lessons Continued): Track Exploration: Track Mini Lessons Before Class If you are participating in the Data Science Mini Lesson today, please review this brief video prior to our class session. For fellows participating in other tracks' Mini Lessons there is no required pre-session videos. Additionally, all fellows are encouraged to independently explore resources, articles, or tutorials related to your track of interest to deepen your understanding and support your track exploration. Additionally, PLEASE BE ADVISED: Track Preference Survey – Time-Sensitive Requirement All Foundations participants must complete the Track Preference Survey after the Thursday, February 6th session", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D3: Track Exploration (Track Mini Lessons Continued): . The survey will close on Friday, February 7th at 11:59 pm – you have just over 24 hours to submit your responses. This survey is mandatory for all fellows, regardless of location or track availability. It also includes questions about device compatibility and short-answer responses critical for your Fellowship preparation. Instructions Here : (W2D4) After Class Assignment: Track Preference Survey Be sure to reserve time to complete this important assignment within the window that it is open. This step is essential for all prospective IF Fellows— failure to complete the survey by Friday, February 7th at 11:59 pm (local time) may disqualify you from further consideration for admission", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D3: Track Exploration (Track Mini Lessons Continued): . During Class Learning Objectives By the end of today's class session, you will: Gain hands-on experience in one of our three tracks: Cybersecurity, Data Science, or Web Development . Explore core concepts, tools, and problem-solving approaches unique to the track through interactive activities. Reflect on your experience to strengthen your understanding of whether this track aligns with your interests, helping you feel confident in your track commitment. Resources Foundations: Zoom Classroom Spreadsheet Cyber Security \"Try-On\" Exercise Data Science \"Try-On\" Exercise Web Development \"Try-On\" Exercise After Class Please continue to work on the following tasks: During this week’s live sessions, you’ll participate in two out of three track-specific \"mini try-on exercises.\" If you’d like to get a taste of the remaining track on your own, you can complete its exercise asynchronously", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D3: Track Exploration (Track Mini Lessons Continued): . Simply locate the corresponding PDF in the \"During Class Resources\" section and follow the instructions. (W2D1) After Class Assignment: Explore Your Preferred Track and Research Associated Roles Please Note: You do not need to submit anything at this time, however you are expected to complete this research by Friday, February 7th -as it will contribute to your Track Preference Survey response. (W2D1) After Class Assignment: Prepare a Question for the Industry Panel Discussion Please Note: You do not need to submit anything at this time, however you are expected to p ost your question or upvote a peer’s question by Thursday, February 6th at 10:00 AM © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D4: Meet the Industry Experts: Meet the Industry Experts: Panel Discussion Before Class Prior to our class session, reserve 45 minutes to watch the videos within this section. During Class Learning Objectives Today’s Panel Discussion Will Provide Insights Related To, Career Pathways: Diverse journeys and key steps professionals took to grow in tech. Essential Skills: The technical and non-technical skills that drive success in tech careers. Industry Trends: Emerging opportunities and how to stay prepared for a changing landscape. Growth Mindset: Mindsets, habits, and qualities that help individuals thrive in tech. Networking Strategies: Ways to build connections and leverage professional resources", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D4: Meet the Industry Experts: . Resources Foundations: Zoom Classroom Spreadsheet W2D4: (East Coast) Meet the Industry Experts W2D4: (West Coast) Meet the Industry Experts There is no Breakout Room Exercise for today's session After Class 1. By Friday, February 7th, 2025 (11:59pm) (W2D4) After Class Assignment: Track Preference Survey – Time-Sensitive Requirement All Foundations participants must complete the Track Preference Survey by Friday, February 7th at 11:59 pm – you have just over 24 hours to submit your responses. This survey is mandatory for all fellows, regardless of location or track availability. It also includes questions about device compatibility and short-answer responses critical for your Fellowship preparation", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › W2D4: Meet the Industry Experts: . This step is essential for all prospective IF Fellows— failure to complete the survey by Friday, February 7th at 11:59 pm (local time) may disqualify you from further consideration for admission. 2. By Monday, February 10th, 2025 Respond to this anonymous, brief Weekly Exit Ticket Links to an external site. © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › (W2D1) After Class Assignment: Explore Your Preferred Track and Research Associated Roles (Assignment)", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › (W2D1) After Class Assignment: Prepare a Question for the Industry Panel Discussion (Assignment)", "[technical] Foundations Course › Week 2: Charting Your Path (Feb. 3rd- Feb 6th) › (W2D4) After Class Assignment: Track Preference Survey (Assignment)", "[technical] Foundations Course › Week 3: Tech Essentials (Feb. 10th- Feb 13th) › Week 3 Overview : Week 3 Overview This week marks an exciting transition as you confirm your track preference and begin diving into track-specific content. Starting Wednesday, 2/12/25, you'll gain access to your track's Canvas course , where you'll begin developing specialized knowledge with your peers and instructional team. This is a significant milestone, as many of your fellow learners and instructors will become key members of your learning journey, helping to guide you as you advance through the remainder of Foundations and toward the Innovation Fellowship. Before you begin your track-specific classes, on Monday and Tuesday we dive into two key sessions that provide a strong foundation for all tracks—whether you're pursuing Cyber Security, Data Science, or Web Development", "[technical] Foundations Course › Week 3: Tech Essentials (Feb. 10th- Feb 13th) › Week 3 Overview : . These sessions are designed to give you a deeper understanding of how computing has evolved and how you can start using powerful tools like the command line to interact with your system. Here’s an overview of what’s ahead this week: W3D1: Mainframes to AI W3D2: Shell Scripting W3D3 & W3D4: The Official Start of Track-Specific Classes! Throughout these sessions, we'll provide a wealth of free online resources for you to explore. Let your curiosity guide you as you dig deeper into the topics that resonate most with you. Important Note: Keep an eye on your inbox! By mid-day February 12th, you’ll receive an invite to a new Canvas course that will indicate the track you’ve been assigned to", "[technical] Foundations Course › Week 3: Tech Essentials (Feb. 10th- Feb 13th) › Week 3 Overview : . A Zoom link for your Wednesday evening session will be included on the new Track-Specific Canvas Course. © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 3: Tech Essentials (Feb. 10th- Feb 13th) › W3D1: Mainframes to AI: Computing Evolution: Mainframes to AI Before Class Please reserve 45 minutes to take a virtual tour of the Computing History Museum prior to our class session During Class Learning Objectives Explore the evolution of computing from mainframes to personal computers Understand the significance of ARPANET and the development of the World Wide Web Identify and explain key computer hardware components (CPU, motherboard, RAM) Resources Foundations: Zoom Classroom Spreadsheet W3D1: Mainframes to AI Slides Wayback Machine After Class You do not need to submit anything related to today's session, however, please do: Be sure to familiarize yourself with your computer hardware by completing the Basic Computer Skills assessment on Northstar Online Learning", "[technical] Foundations Course › Week 3: Tech Essentials (Feb. 10th- Feb 13th) › W3D1: Mainframes to AI: . Continue exploring the resources shared in today's class. Review the Before Class materials for W3D2: Shell Scripting Important Note: Keep an eye on your inbox! By mid-day February 12th, you’ll receive an invite to a new Canvas course that will indicate the track you’ve been assigned to. A Zoom link for your Wednesday evening session will be included on the new Track-Specific Canvas Course. © 2024 The Knowledge House | All Rights Reserved", "[technical] Foundations Course › Week 3: Tech Essentials (Feb. 10th- Feb 13th) › W3D2: Shell Scripting: Shell Scripting Before Class Prior to class, please be sure to reserve 1 hour to do the following: Watch: Read: History of Operating Systems Do: Sign up for a free account at pwn.college , you will need an account to participate in today's session During Class Learning Objectives Explain the relationship between the shell, operating system, and hardware Navigate file systems confidently using command line tools Write basic shell scripts to automate multi-step tasks Resources Foundations: Zoom Classroom Spreadsheet W3D2: Shell Scripting Slides Linux Luminarium Comprehending Commands After Class No After Class Assignment to Submit There is no After Class Assignment required for this session, but we encourage you to follow your curiosity! Here are some excellent resources to help you continue expanding your Shell Scripting skills: Review the Shell lesson from The Missing Semester by MIT Read the slides from Stanford’s CS45 lesson on Shell Tools Explore How to Write a Shell Script on GeeksforGeeks Check out the Linux BASH Shell Scripting Tutorial Refer to the Linux Cheatsheet Keep exploring and deepening your knowledge! Important Note: Keep an eye on your inbox! By mid-day February 12th (at the latest), you’ll receive an invite to a new Canvas course that will indicate the track you’ve been assigned to", "[technical] Foundations Course › Week 3: Tech Essentials (Feb. 10th- Feb 13th) › W3D2: Shell Scripting: . A Zoom link for your Wednesday evening session will be included on the new Track-Specific Canvas Course. © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Fellow Success Resources: Student Success Resources Type Description Link to resource Student Success Specialist Contact Information This spreadsheet has information on updated contact information for your student success specialist team. (emails, booking links, and phone numbers) Contact Information Innovation Fellowship Student Success Handbook This handbook has information about best practices, expectations, and policies related to the Innovation Fellowship. IF '25 Student Success Handbook Innovation Fellowship Student Success Calendar (LIVE) Student Success Calendar provides program dates for when Phases start and end, holidays/NO CLASS, events, and when incentives will be distributed", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Fellow Success Resources: . IF '25 Student Success Calendar Student Success Portal The Student Success Portal offers community-based support and self-help resources to help students overcome obstacles and stay on track to complete their programs. It connects students with the tools and network they need to succeed. Student Success Portal Support Service Request Form Alert the Student Success Team that you need support. This includes things like mental health resources, access to internet services, caregiver support, and more. This form is also utilized to request need-based funds, flexible learning accommodations, and soft-skill coaching", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Fellow Success Resources: . Support Services Request Form Technical Equipment Support/Request Alert the Operational Team that you have a technical support need. This includes things like access to a laptop and set-up, IT support, etc. TKH Fellow IT Request form Incident Report Please alert the TKH leadership team that you had an incident with a TKH staff member, volunteer, or peer. Incident Form", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Help Request Steps: 🛠️ Help Request Steps Please Complete the steps listed here before asking instructors for help on assignments or projects. You will copy the numbered steps below and fill in your responses under each heading. Make sure your Help Request is formatted neatly and easy to read. Paste your completed Help Request in the class forum under ‘Discussions’ on Canvas or the Slack help channel (in a thread) to see if peers can assist before reaching out to an instructor. Include in the title: “ Help Request: “ and add your current assignment or project name, as well as the area of concern. Keep the subject line to one line only", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Help Request Steps: . Example: “Help Request: Client Portfolio Design + CSS is not changing the styling in my HTML webpage” Only ask an instructor/TA if the issue remains unresolved after troubleshooting with classmates. This encourages problem-solving, peer collaboration, and efficient use of instructor time . 🚀 1. What is the problem? (Describe the issue you are facing. Be as specific as possible. Include error messages, unexpected behavior, or where you are stuck.) 2. What solutions or troubleshooting have you tried so far? (List the steps you have already taken to troubleshoot or resolve the issue) 3. What research have you done? (Share relevant articles, documentation, forum posts, or other resources you have consulted", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Help Request Steps: . Include links if possible.) 4. What is your current understanding of the problem? (Explain what you think is happening and why. This helps clarify your thought process and allows for better guidance.) 5. Code Snippet (if applicable) (Include relevant code. Keep it minimal and focused on the issue.) // Paste your code here, if applicable. 6. Additional Context (Anything else that might be relevant? Specific browser, tech stack, recent changes to your code, etc.) 7. Solution (If you have arrived at a solution after troubleshooting, explain what the problem was and how the solution addressed the problem so that others who encounter the same issue may benefit.)", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Culture Contract - Data Science: external link https://docs.google.com/document/d/15_ibCpU7lgvMpRNtFh5In6fBgRj-7xGKh13-VJ_kJ6U/edit?usp=sharing", "[technical] IF '25 Data Science Cohort A › Fellow Resources › IF 25 DS Syllabus: external link https://docs.google.com/document/d/1XPcdVqqWs6lFGLcSvkZ4604QNUreO8m7QiuGJ88vKl8/edit?tab=t.0", "[technical] IF '25 Data Science Cohort A › Fellow Resources › Student Guide: Using External Code & AI Responsibly: external link https://docs.google.com/document/d/1rECLW7wpHFAcGXvdbFdqyF4oYl_uAFkC0PxbaCPi1hc/edit?tab=t.0#heading=h.lmp53jlanmmz", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 📚 P1W1 Overview & Lesson Plan: Week 1 Overview & Lesson Plan Welcome to week 1! We will post a set of pre-class resources within the overview page each week to preempt the lecture, followed by a small 5-question quiz due before Monday's class to affirm your knowledge. We encourage you to study these resources carefully, as they will prepare you to understand the topics we will go over during class. As this is the first week, we will skip the quiz. We will also post all incoming assignments on this page to ensure that you have ample time to complete them. Here’s an overview of what’s ahead this week: W1D1 (Re)-Introduction to Data Science W1D2 Advanced Control Flow I W1D3 Visualizing Data Pre-Class Content Pep 8 - Style Guide for Python Code Numpy Style Guide Think Python Ch5 (5.1 - 5.7) Think Python Ch3 (3.1 - 3.5) Python File I/O Assignments [TLAB] Advanced Health Monitoring Analysis (Due 3/28) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 💻 W1D1 (3/10) (Re)-Introduction to Data Science: Monday, March 10, 5:30-9:30pm ET (Re)-Introduction to Data Science Before Class Pep 8 - Style Guide for Python Code Numpy Style Guide Think Python Ch5 (5.1 - 5.7) During Class Learning Objectives By the end of this session, fellows will be able to: Document and describe functions Review basic conditionals and implement nested conditionals in Python Understand common logical patterns in Python Understand key signifiers of the future of data science Agenda Warm Up (15 minutes) Canvas & Data Science Review (30 minutes) Docstrings in Functions (15 minutes) Control Flow & Truthiness (30 minutes) Nested if Statements (30 minutes) Break (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments VSCode Course Unit 3 : Lesson 1 - Lesson 4 VSCode Course Unit 2 : Lesson 6 - Lesson 8 Instructional Materials [Slides] (Re)-Introduction to Data Science [Code] Control Flow & Truthiness After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 💻 W1D1 (3/10) (Re)-Introduction to Data Science: . Additional Resources (Optional) RealPython - Documenting Python Code RealPython - Conditional Statements Kaggle - Booleans & Conditionals © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 💻 W1D2 (3/11) Advanced Control Flow I: Tuesday, March 11, 5:30-9:30pm ET Advanced Control Flow Before Class Think Python Ch3 (3.1 - 3.5) During Class Learning Objectives By the end of this session, fellows will be able to: Understand common logical patterns in Python Understand how to implement for loops Integrate for-loops with data structures Agenda Warm Up (30 minutes) Logical Patterns (30 minutes) For Loops (30 minutes) For Loop Patterns (30 minutes) Break (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments VSCode Course Unit 5 : Lesson 1 - Lesson 3 Instructional Materials [Slides] Advanced Control Flow [Code] For Loops After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 💻 W1D2 (3/11) Advanced Control Flow I: . Additional Resources (Optional) RealPython - For Loops © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 💻 W1D3 (3/12) Introduction to Data Processing: Tuesday, March 12, 5:30-9:30pm ET Introduction to Data Processing Before Class Python File I/O During Class Learning Objectives By the end of this session, fellows will be able to: Implement advanced for-loop patterns in Python Understand how to interpret paths on your operating system Understand how to work with text files in your Python program Agenda Warm Up (15 minutes) Advanced For Loop Patterns (45 minutes) Paths (30 minutes) File I/O (30 minutes) Break (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments VSCode Course Unit 6 : Lesson 1 - Lesson 4 Instructional Materials [Slides] Introduction to Data Processing After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 💻 W1D3 (3/12) Introduction to Data Processing: . Additional Resources (Optional) RealPython - Read/Write Files in Python RealPython - Working with Files in Python © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › 🤖 P1W1 Post Class Summary: Week 1 Post Class Summary Each week, we will also post a Notebook LM \" podcast-style\" summary of the weeks content. Lastly, we will dedicate a section for incoming assignments so that no assignment catches you by surprise. Great work and see you all for week 2! Notebook LM podcast summary of the week: Assignments [TLAB] Advanced Health Monitoring Analysis (Due 3/28) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › [TLAB] Advanced Health Monitoring Analysis (Due 3/28) (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W1 (3/10-3/14) (Re)-Introduction to Data Science › Culture Contract - Data Science: external link https://docs.google.com/document/d/15_ibCpU7lgvMpRNtFh5In6fBgRj-7xGKh13-VJ_kJ6U/edit?usp=sharing", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 📚 P1W2 Overview & Lesson Plan: Week 2 Overview & Lesson Plan This week, we will begin our exploration of hiding, or 'abstracting away', complex details into Python structures called \"classes.\" Before we dive into this concept, we will go over the different types of \"data-structures\" that we can use that go beyond simple lists. This will entail the following: Working with various data structures in Python Implementing basic class definitions Using defined classes as objects in your code. Here’s an overview of what’s ahead this week: W2D1 (Re)-Introduction to Data Science W2D2 Advanced Control Flow I W2D3 Visualizing Data Pre-Class Content Think Python Ch14 (14.1 - 14.5) Think Python Ch15 (15.1 - 15.4;15.6) Think Python Ch16 (16.1 - 16.3) Learning Statistics with R Ch 5 (5.2 - 5.3) Assignments [TQZ] OOP Quiz [TQZ] W2 Pre-Class Content Quiz [TLAB] Advanced Health Monitoring Analysis (Due 3/28) © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 💻 W2D1 (3/17) Introduction to Abstraction: Monday, March 17, 5:30-9:30pm ET Introduction to Abstraction Before Class Think Python Ch14 (14.1 - 14.5) During Class Learning Objectives By the end of this session, fellows will be able to: Learn about the different coding paradigms and the utility of OOP Implement data classes in Python Learn about the distinction between classes and objects Agenda Warm Up (15 minutes) Data Structures (45 minutes) Abstraction (60 minutes) Break (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments VSCode Unit 4: Lesson 1 - Lesson 3 Instructional Materials [Slides] Introduction to Abstraction After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 💻 W2D1 (3/17) Introduction to Abstraction: . © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 💻 W2D2 (3/18) Advanced Abstraction: Monday, March 18, 5:30-9:30pm ET Advanced Abstraction Before Class Think Python Ch15 (15.1 - 15.4;15.6) Think Python Ch16 (16.1 - 16.3) During Class Learning Objectives By the end of this session, fellows will be able to: Learn about the different coding paradigms and the utility of OOP Implement data classes in Python Learn about the distinction between classes and objects Agenda Warm Up (30 minutes) Data Structures overview (15 minutes) Data Classes (45 minutes) Break (30 minutes) Content Review (30 minutes) Lab (1 hour ) In-Class Assessments VSCode Course Unit 4 : Lesson 1 - Lesson 3 Instructional Materials [Slides] Advanced Abstraction [Code] Dataclasses After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 💻 W2D2 (3/18) Advanced Abstraction: . Additional Resources (Optional) RealPython - Object Oriented Programming in Python © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 🧪 W2D3 (3/19) Measures of Dispersion & The Central Limit Theorem: Monday, March 19, 5:30-9:30pm ET Measures of Dispersion & The Central Limit Theorem Before Class The Main Ideas Behind Probability Distributions Purpose: Learn about the process of calculating a probability distribution. Central Limit Theorem, Clearly Explained Purpose: Understand the importance of CLT. Types of Statistical Distributions in ML Purpose: Learn about the different types of distributions in machine learning. During Class Learning Objectives By the end of this session, fellows will be able to: Interpret probability distributions Identify the importance of the central limit theorem Agenda Warm Up (15 minutes) Dispersion Review (45 minutes) Prob distributions & CLT (30 minutes) Break (30 minutes) Python Implementations Review (30 minutes) Lab (1 hour ) In-Class Assessments [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Instructional Materials Slides - Measures of Dispersion & Central Limit Theorem After Class Assignments Complete the following by 3/31: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 🧪 W2D3 (3/19) Measures of Dispersion & The Central Limit Theorem: . Additional Resources (Optional) Emory University - Probability Distributions Exercises © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › 🤖 P1W2 Post Class Summary : Week 2 Post Class Summary Notebook LM podcast summary of the week: This week, we reviewed advanced Python concepts that allow us to bundle related data into one cohesive structure or \"object.\" This included a review of various data-structures such as lists, tuples, dictionaries, and sets. In addition, we also reviewed the \"dataclass\" object which allowed us to bundle related \"fields\" in one cohesive template. 'Design and programming are human activities; forget that and all is lost.' - B. Stroustrup Extra Resources Real Python - Read/Write Files in Python Real Python - Python Data Structures Real Python - Dataclasses Assignments [TQZ] Statistics Quiz [TQZ] W3 Pre-Class Content Quiz [TLAB] Advanced Health Monitoring Analysis (Due 3/28) © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › [TQZ] Week 2 Pre-Class Content Quiz (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W2 (3/17-3/21) Introduction to Abstraction › [TQZ] OOP Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 📚 P1W3 Overview & Lesson Plan: Week 3 Overview & Lesson Plan Welcome to week 3! Now that you've made it this far, take a moment to acknowledge the full breadth of content and work you've been completing within this fellowship. Remember, this is challenging stuff! However it would not be worth completing if it was not challenging. Now that we have a solid Python foundation, we will move forward with utilizing this technical know-how in order to process numerical data from various sources. This week, we will go over File I/O once more, and additionally set up software tools on your local machine. Remember to be patient with yourselves (and your computers) as you work through Here’s an overview of what’s ahead this week: W3D1 Introduction to Conda Environments & File I/O Review W3D2 Advanced Data Processing W3D3 Data Visualizations Review Pre-Class Content Why You Need Python Environments… Conda for Data Scientists How to Read JSON Files in Python Working with JSON Data in Python What Data Visualizations to Use Downloads VSCode Download Git Download Miniconda Download Assignments [TQZ] Week 3 Pre-Class Content Quiz [TQZ] Statistics Quiz [TLAB] Advanced Health Monitoring Analysis (Due 3/28) © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 💻 W3D1 (3/24) Introduction to Conda Environments & File I/O Review: Monday, March 24, 5:30-9:30pm ET Introduction to Conda Environments & File I/O Review Before Class Why You Need Python Environments… Conda for Data Scientists 💻 W1D3 (3/12) Introduction to Data Processing During Class Learning Objectives By the end of this session, fellows will be able to: Ensure proper setup of all software tools for Phase 1 Review usage of software tools Create conda environment Understand how to work with text files in your Python program Agenda Warm Up (30 minutes) Software Tools Review (30 minutes) File I/O Review (30 minutes) Break (30 minutes) Conda Lab (1 hour, 30 minutes) In-Class Assessments Conda Lab Instructional Materials [Slides] Introduction to Conda Environments & File I/O Review After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 💻 W3D1 (3/24) Introduction to Conda Environments & File I/O Review: . Additional Resources (Optional) © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 💻 W3D2 (3/25) Advanced Data Processing: Tuesday, March 25, 5:30-9:30pm ET Advanced Data Processing Before Class How to Read JSON Files in Python Working with JSON Data in Python During Class Learning Objectives By the end of this session, fellows will be able to: Review the different data formats you will work with during the fellowship Understand how to interpret a JSON file Get introduced to working with JSON files in Python Agenda Warm Up (15 minutes) Hierarchy of Data Needs (15 minutes) Data Formats (30 minutes) JSON & Nested Data (30 minutes) Break (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments JSON Lab Instructional Materials [Slides] Advanced Data Processing [Code] JSON Intro After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 💻 W3D2 (3/25) Advanced Data Processing: . Additional Resources (Optional) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 🧪 W3D3 (3/26) Data Visualizations Review: Wednesday, March 26, 5:30-9:30pm ET Data Visualizations Review Before Class What Data Visualizations to Use During Class Learning Objectives By the end of this session, fellows will be able to: Understand which visualizations to choose for your analysis Learn how to make data visualizations in Python Understand the fundamentals of matplotlib Warm Up (15 minutes) Types of variables (15 minutes) Types of visualizations (30 minutes) Using matplotlib (30 minutes) Break (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Instructional Materials [Slides] Data Visualizations Review After Class Assignments Complete the following by 3/28: [TLAB] Advanced Health Monitoring Analysis (Due 3/28) Project Milestone: You will develop an analysis that identify periods when a user sleeps or exercises using their varying recorded heart rates", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 🧪 W3D3 (3/26) Data Visualizations Review: . Additional Resources (Optional) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › 🤖 P1W3 Post Class Summary: Week 3 Post Class Summary Notebook LM podcast summary of the week: This week, we reviewed our file i/o knowledge, worked to get conda set up on our systems, and began our first steps into the wide world of data processing. We then concluded this week with a review on visualizations and how to create these visualizations Extra Resources Real Python - An Effective Python Environment Real Python - Reading and Writing Files in Python Assignments [TLAB] Advanced Health Monitoring Analysis (Due 3/28) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › [TQZ] Week 3 Pre-Class Content Quiz (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W3 (3/24-3/28) Introduction to Data Processing › [TQZ] Statistics Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 📚 P1W4 Overview & Lesson Plan: Week 4 Overview & Lesson Plan Welcome to week 4. This week we will continue deepening our expertise in processing different types of data formats, however this time, we will be programmatically requesting this data over the web using REST APIs. In addition to requesting data, we will explore our how we can send queries over the web. This will be highly applicable when it comes time to start our second TLAB. Here’s an overview of what’s ahead this week: W4D1 Applied Rest APIs I W4D2 Applied Rest APIs II W4D3 Probability Review Pre-Class Content What is a REST API? Examples, Uses, and Challenges Getting Data from an API API Ingestion in Python Jupyter Notebooks in VSCode Assignments [TQZ] Week 4 Pre-Class Content Quiz [TLAB] OpenAI API Auto-Evaluation © 2024 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 💻 W4D1 (3/31) Applied REST APIs I: Monday, March 31, 5:30-9:30pm ET Applied REST APIs I Before Class What is a REST API? Examples, Uses, and Challenges Getting Data from an API API Ingestion in Python Jupyter Notebooks in VSCode During Class Learning Objectives By the end of this session, fellows will be able to: Learn how to request data programmatically over the web Learn how to transform JSON files into structured data Get introduced to Jupyter notebooks Agenda Intros, Announcements, Check-ins (15 minutes) Jupyter Notebooks (15 minutes) Requests (30 minutes) API Calls (30 minutes) Break (30 minutes) Lab Tutorial (30 minutes) Lab (1 hour) In-Class Assessments Requests Lab Instructional Materials [Slides] Applied Rest APIs I After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 💻 W4D1 (3/31) Applied REST APIs I: . Additional Resources (Optional) Real Python - Rest APIs with Flask © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 💻 W4D2 (4/1) Applied REST APIs II : Tuesday, April 1, 5:30-9:30pm ET Applied REST APIs II Before Class What is a REST API? Examples, Uses, and Challenges Getting Data from an API API Ingestion in Python Jupyter Notebooks in VSCode During Class Learning Objectives By the end of this session, fellows will be able to: Review Rest API usage Get introduced to LLM technology Learn how to use the OpenAI API Discover the principles of effective requests Agenda Rest API Review (15 minutes) LLM Intro (15 minutes) OpenAI API (30 minutes) Prompt Engineering (30 minutes) Break (30 minutes) Lab Review (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments OpenAI API Lab Instructional Materials [Slides] Applied Rest APIs II After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 💻 W4D2 (4/1) Applied REST APIs II : . Additional Resources (Optional) Data Camp - Beginners Guide to OpenAI API © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 🧪 W4D3 (4/2) Probability II: Wednesday, April 2, 5:30-9:30pm ET Probability II Before Class The Bayesian Trap During Class Learning Objectives By the end of this session, fellows will be able to: Review basic probability Understand how sample calculations differ from population Understand & apply Bayes Theorem Agenda Warm Up (15 minutes) Sample Statistics Review (30 minutes) Probability Review (45 minutes) Break (30 minutes) Bayes Theorem (30 minutes) Lab (1 hour, 30 minutes) In-Class Assessments [TLAB] OpenAI API Auto-Evaluation Instructional Materials [Slides] Probability Review After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 🧪 W4D3 (4/2) Probability II: . Additional Resources (Optional) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › 🤖 P1W4 Post Class Summary: Week 4 Post Class Summary FarukhGPT podcast summary of the week: This week we reviewed the Python syntax necessary to begin interacting with Web APIs. We also reviewed the openai package in Python, before finally concluding our day with a little Bayes Theorem. See you all next week! Extra Resources Real Python - Rest APIs with Flask Assignments [TLAB] OpenAI API Review Auto Evaluation (Due 4/21) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › [TQZ] Week 4 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W4 (3/31-4/4) Applied REST APIs › [TLAB] OpenAI API Review Auto-Evaluation (Due 4/21)  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 📚 P1W5 Overview & Lesson Plan : Week 5 Overview & Lesson Plan Welcome to week 5. This week, we will shift gears and instead focus on getting data with the assistance of a web-scraper. This will entail Here’s an overview of what’s ahead this week: W5D1 Applied Web Scraping I W5D2 Applied Web Scraping II W5D3 Hypothesis Testing Pre-Class Content Intro to HTML Python Web-Scraping Introduction A Gentle Introduction to Hypothesis Testing Regex One Assignments [TQZ] Week 5 Pre-Class Content Quiz [TLAB] OpenAI API Auto-Evaluation © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 💻 W5D1 (4/7) Applied Web Scraping I: Monday, April 7, 5:30-9:30pm ET Applied Web Scraping I Before Class Intro to HTML Python Web-Scraping Introduction During Class Learning Objectives By the end of this session, fellows will be able to: Interpret HTML pages and tags Learn how to request data over the web and scrape via the bs4 package Learn about common Web-scraping Methods Agenda Warmup (30 minutes) HTML Review (30 minutes) Web-Scraping Intro (30 minutes) Break (30 minutes) Web-Scraping Intro (30 minutes) Lab (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments Web-Scraping Lab Instructional Materials [Slides] Applied Web Scraping I After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 💻 W5D1 (4/7) Applied Web Scraping I: . Additional Resources (Optional) Web Scraping 101 with Python © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 💻 W5D2 (4/8) Applied Web Scraping II: Tuesday, April 8, 5:30-9:30pm ET Applied Web Scraping I Before Class During Class Learning Objectives By the end of this session, fellows will be able to: Review web-scraping methods Review list methods for TLAB #2 success Learn about the concept of regular expressions Agenda Web-Scraping Review (30 minutes) String Methods Review (30 minutes) Regex Review (30 minutes) Break (30 minutes) Lab introduction (30 minutes) Lab (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments Web-Scraping II Lab Instructional Materials [Slides] Applied Web Scraping II After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 💻 W5D2 (4/8) Applied Web Scraping II: . Additional Resources (Optional) Web Scraping 101 with Python Regex One © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 🧪 W5D3 (4/9) Introduction to Hypothesis Testing: Wednesday, April 9, 5:30-9:30pm ET Introduction to Hypothesis Testing Before Class A Gentle Introduction to Hypothesis Testing During Class Learning Objectives By the end of this session, fellows will be able to: Review the concept of probability distributions Understand what a hypothesis test is using a real example Identify the steps to hypothesis testing Agenda Distributions & Z-score (30 minutes) Intro to Hypothesis Testing (30 minutes) ESP Part 1 (30 minutes) Break (30 minutes) ESP Part 2 (30 minutes) Lab (1 hour, 20 minutes) Wrap-up (10 minutes) In-Class Assessments [TLAB] OpenAI API Auto-Evaluation Instructional Materials [Slides] Hypothesis Testing After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 🧪 W5D3 (4/9) Introduction to Hypothesis Testing: . Additional Resources (Optional) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › 🤖 P1W5 Post Class Summary: Week 5 Post Class Summary NotebookLM podcast summary of the week: This previous week we dove into the process of \"scraping\" information off of a website using both the requests package and beautifulsoup4. Next week, we will dive into the process of grabbing this data and transforming it using both pandas and google sheets. Assignments [TLAB] OpenAI API Review Auto Evaluation (Due 4/21) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W5 (4/7-4/11) Applied Web Scraping › [TQZ] Week 5 Pre-Class Content Quiz (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 📚 P1W6 Overview & Lesson Plan: Week 6 Overview & Lesson Plan Welcome to week 6. This week, we will begin the process of data analysis. Here’s an overview of what’s ahead this week: W6D1 Introduction to Data Analysis I W6D2 Introduction to Data Analysis II W6D3 Pandas & Data Reporting Pre-Class Content Career Foundry - What is Data Analytics Simpletivity - How to Use Pivot Tables in Google Sheets Alex the Analyst - Reading Files in Pandas Alex the Analyst - Filtering Columns & Rows Alex the Analyst - Indexes in Pandas Alex the Analyst - Merging Dataframes in Pandas Assignments [TQZ] Week 6 Pre-Class Content Quiz [TLAB] OpenAI API Auto-Evaluation © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 💻 W6D1 (4/14) Introduction to Data Analysis I: Monday, April 14, 5:30-9:30pm ET Introduction to Data Analysis I Before Class Career Foundry - What is Data Analytics Simpletivity - How to Use Pivot Tables in Google Sheets During Class Learning Objectives By the end of this session, fellows will be able to: Modify column names, sort columns, and format columns in Google Sheets Create bar-plots, line-plots, and scatter plots in Google sheets Calculate aggregate metrics using the functions Create and read pivot tables in Google Spreadsheets Agenda Warmup (15 minutes) Sheets Demo (75 minutes) Break (30 minutes) Sheets Lab Intro (30 minutes) Lab (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments Google Sheets Lab Instructional Materials [Slides] Introduction to Data Analysis I [Notes] In-Class Exercise: Exploring Google Sheets for Data Summarization After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 💻 W6D1 (4/14) Introduction to Data Analysis I: . Additional Resources (Optional) Pandas Basics Indexing and Selecting Data Merging DataFrames How to Create Pivot Tables with pandas © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 💻 W6D2 (4/15) Introduction to Data Analysis II: Tuesday, April 15, 5:30-9:30pm ET Introduction to Data Analysis II Before Class Alex the Analyst - Reading Files in Pandas Alex the Analyst - Filtering Columns & Rows Alex the Analyst - Indexes in Pandas 10 Minutes to Pandas During Class Learning Objectives By the end of this session, fellows will be able to: Load a dataset into a pandas DataFrame Use basic methods to explore and describe your dataset Drop rows with missing values Select specific columns using .loc Apply simple boolean conditions to filter your data Agenda Pandas Intro & Code-Along (1 hour 30 minutes) Break (30 minutes) Pandas Lab Intro (30 minutes) Lab (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments Pandas Lab Instructional Materials [Slides] Introduction to Data Analysis II [Notes] In-Class Exercise: Getting Started with Pandas in Python After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 💻 W6D2 (4/15) Introduction to Data Analysis II: . Additional Resources (Optional) Alex the Analyst - Merging Dataframes in Pandas © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 🧪 W6D3 (4/16) Data Reporting: Wednesday, April 16, 5:30-9:30pm ET Data Reporting Before Class Alex the Analyst - Merging Dataframes in Pandas During Class Learning Objectives By the end of this session, fellows will be able to: Load CSV data into pandas DataFrames. Concatenate datasets with similar structure using pd.concat(). Merge datasets on a common key using pd.merge(). Review foundational pandas methods to inspect your dataframes. Apply best practices when summarizing and reporting your findings. Agenda Warm Up (30 minutes) Pandas Merge Code-Along (60 minutes) Break (30 minutes) Data Reporting (30 minutes) TLAB (1 hour, 20 minutes) Wrap-up (10 minutes) In-Class Assessments Pandas Code-Along Instructional Materials [Slides] Data Reporting [Notes] In-Class Exercise: Data Wrangling with pandas After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 🧪 W6D3 (4/16) Data Reporting: . Additional Resources (Optional) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › 🤖 P1W6 Post Class Summary: Week 6 Post Class Summary NotebookLM podcast summary of the week: This previous week we learned about the pandas package. This will be our tool of choice for all future data analysis workflows. We will also utilize this package for data transformations and exploratory analysis. Assignments [TLAB] OpenAI API Review Auto Evaluation (Due 4/21) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W6 (4/14-4/18) Introduction to Data Analysis › [TQZ] Week 6 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 📚 P1W7 Overview & Lesson Plan: Week 7 Overview & Lesson Plan Welcome to week 7. This week, we will continue to explore the applications of pandas in data analytics. Here’s an overview of what’s ahead this week: W7D1 Advanced Data Analysis I W7D2 Advanced Data Analysis II W7D3 AB Testing Pre-Class Content What is Exploratory Data Analysis? Data Transformation using Pandas Group by: split-apply-combine Alex the Analyst: Exploratory Data Analysis in Pandas Alex the Analyst: Regular Expressions Use Cases in Python Alex the Analyst: Group By & Aggregate Functions in Pandas Assignments [TQZ] Week 7 Pre-Class Content Quiz [TLAB] OpenAI API Auto-Evaluation © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 💻 W7D1 (4/21) Advanced Data Analysis I: Monday, April 21, 5:30-9:30pm ET Advanced Data Analysis I Before Class What is Exploratory Data Analysis? Group by: split-apply-combine Alex the Analyst: Exploratory Data Analysis in Pandas During Class Learning Objectives By the end of this session, fellows will be able to: Use basic and intermediate pandas methods to summarize and explore a dataset Understand and apply univariate and bivariate analysis techniques Interpret histograms, bar plots, box plots, scatter plots, and KDE plots Explain why each analysis matters and what insight it helps us uncover Agenda Leetcode Warmup (30 minutes) Exploratory Data Analysis (60 minutes) Break (30 minutes) Exploratory Data Analysis (30 minutes) Lab (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments EDA Lab Instructional Materials [Slides] Advanced Data Analysis I [Notes] In-Class Exercise: Data Exploration with Pandas: Apartment Listings After Class Assignments Complete the following by 4/21: [TLAB] OpenAI API Auto-Evaluation Project Milestone: You will develop a pipeline that sends data to an OpenAI API and returns sentiment", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 💻 W7D1 (4/21) Advanced Data Analysis I: . Additional Resources (Optional) Kaggle - Learn Pandas - Hello, Seaborn Kaggle - Learn Pandas - Line Charts Kaggle - Learn Pandas - Bar Charts & Heatmaps Kaggle - Learn Pandas - Scatter Plots Kaggle - Learn Pandas - Distributions © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 💻 W7D2 (4/22) Advanced Data Analysis II: Tuesday, April 22, 5:30-9:30pm ET Advanced Data Analysis II Before Class Group by: split-apply-combine Alex the Analyst: Group By & Aggregate Functions in Pandas During Class Learning Objectives By the end of this session, fellows will be able to: Use pivot_table to compare numerical values across multiple groupings Apply groupby() to generate targeted summary statistics Use qcut() to create new categories from numeric variables Agenda Leetcode Warmup (30 minutes) Exploratory Data Analysis (60 minutes) Break (30 minutes) Exploratory Data Analysis (30 minutes) Lab (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments EDA II Lab Instructional Materials [Slides] Advanced Data Analysis II [Notes] In-Class Exercise: Digging Deeper Into Apartment Trends After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 💻 W7D2 (4/22) Advanced Data Analysis II: . Additional Resources (Optional) Kaggle Learn Pandas - Grouping & Sorting Kaggle - Learn Pandas - Renaming & Combining © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 🧪 W7D3 (4/23) Pandas Review: Wednesday, April 23, 5:30-9:30pm ET Pandas Review Before Class Ensure you've signed up to LeetCode During Class Learning Objectives By the end of this session, fellows will be able to: Simulate the interview process by asking you to complete and present technical challenges live. Get started with TLAB #3. Agenda LeetCode Problems (90 minutes) Break (30 minutes) TLAB #3 (1 hour, 50 minutes) Wrap-up (10 minutes) In-Class Assessments LeetCode - Concatenate LeetCode - Pivot LeetCode - Number of Unique Subjects LeetCode - Classes More Than 5 Students Instructional Materials [Slides] Pandas Review [Notes] In-Class Exercise: LeetCode Problems After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 🧪 W7D3 (4/23) Pandas Review: . Additional Resources (Optional) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › 🤖 P1W7 Post Class Summary: Week 7 Post Class Summary NotebookLM podcast summary of the week: This previous week we dove into the concept of exploratory data analysis, and subsequently expanded our pandas vocabulary by adding data visualizations, binning, pivot tables, and group-bys into our toolbelt. We will use these methods heavily in next weeks case studies. Assignments [TLAB] Weather API Data Analysis (due 5/14) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › [TQZ] Week 7 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W7 (4/21-4/25) Advanced Data Analysis › [TLAB] Weather Data Analysis (Due 5/14) (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 📚 P1W8 Overview & Lesson Plan: Week 8 Overview & Lesson Plan Welcome to week 8. This week we will begin applying our knowledge of EDA and pandas syntax to independently complete two case studies. Here’s an overview of what’s ahead this week: W8D1 Pandas Case Study I: Shopping Data Analytics W8D2 Pandas Case Study II: Twitter Dataset W8D3 AB Testing Pre-Class Content Working with Dates and Time Series Data DataCamp - Pandas Resample With resample() and asfreq() Alex the Analyst: Regular Expressions Use Cases in Python Regex One Defining Business Problems for Analytical Thinking StatQuest - Hypothesis Testing & the Null Hypothesis Assignments [TQZ] Week 8 Pre-Class Content Quiz [TLAB] Weather Data Analysis © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 💻 W8D1 (4/28) Shopping Dataset Case Study: Monday, April 28, 5:30-9:30pm ET Shopping Dataset Case Study Before Class Defining Business Problems for Analytical Thinking During Class Learning Objectives By the end of this session, fellows will be able to: Apply basic and intermediate pandas methods to explore a structured dataset Perform univariate and bivariate analysis on real-world shopping data Create visualizations using seaborn to support your findings Use grouping and aggregation techniques such as groupby() , pivot_table() , qcut() , and agg() Develop and communicate insights clearly based on observed data patterns, not just the code used Agenda Intro to Case Study (15 minutes) Case Study Code-Along (1 hour, 15 minutes) Break (30 minutes) Complete Case Study (2 hours) Wrap-Up (10 minutes) In-Class Assessments Shopping Data Analytics Case Study Instructional Materials [Slides] Shopping Dataset Case Study [Notes] Guided Case Study: Exploring Shopping Trends with Pandas After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 💻 W8D1 (4/28) Shopping Dataset Case Study: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 💻 W8D2 (4/29) Twitter Dataset Case Study: Tuesday, April 29, 5:30-9:30pm ET Twitter (I am never calling it \"X\") Dataset Case Study Before Class Working with Dates and Time Series Data DataCamp - Pandas Resample With resample() and asfreq() Alex the Analyst: Regular Expressions Use Cases in Python Regex One During Class Learning Objectives By the end of this session, fellows will be able to: Perform time series exploration using pandas Extract key date-time features like hour and weekday Analyze and visualize patterns in tweet volume and sentiment Use string matching techniques to filter tweets by content Focus on developing insightful conclusions , not just writing code Agenda Intro to Case Study (15 minutes) Case Study Code-Along (1 hour, 15 minutes) Break (30 minutes) Complete Case Study (2 hours) Wrap-Up (10 minutes) In-Class Assessments Twitter Dataset Case Study Instructional Materials [Slides] Twitter Dataset Case Study [Notes] Guided Case Study: Exploring Twitter Sentiment Over Time After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 💻 W8D2 (4/29) Twitter Dataset Case Study: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 🧪 W8D3 (4/30) AB Testing: Wednesday, April 30, 5:30-9:30pm ET AB Testing Before Class StatQuest - Hypothesis Testing & the Null Hypothesis During Class Learning Objectives By the end of this session, fellows will be able to: Explain the purpose of a two-sample t-test and when it’s appropriate to use Calculate a t-score using sample means, variances, and sample sizes Interpret a p-value and explain what it tells us about statistical significance Identify key real-world considerations when applying t-tests in A/B testing, such as sample size Agenda Warm-Up (30 minutes) T-Testing Review (60 minutes) Break (30 minutes) AB Testing (30 minutes) TLAB #3 (1 hour, 20 minutes) Wrap-up (10 minutes) In-Class Assessments [TLAB] Weather API Data Analysis Instructional Materials [Slides] AB Testing After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 🧪 W8D3 (4/30) AB Testing: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › 🤖 P1W8 Post Class Summary: Week 8 Post Class Summary NotebookLM podcast summary of the week: This previous week we completed a few case studies on exploratory analysis using pandas, and concluded our week with confirmatory data analysis using hypothesis testing. Next week, we will begin learning about database management via SQL. Assignments [TLAB] Weather API Data Analysis (due 5/14) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W8 (4/28-5/2) Pandas Case Studies › [TQZ] Week 8 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 📚 P1W9 Overview & Lesson Plan: Week 9 Overview & Lesson Plan Welcome to week 9! This week we will continue our exploration of data analysis, except this time, we will use a more \"human-friendly\" domain specific language to interface with our datasets. This language is called SQL. Data analysts across all domains rely on SQL to answer ad-hoc analytical questions, perform exploratory analysis, and even maintain the systems that collect business information. To learn more about SQL, check out the Pre-Class content below. Here’s an overview of what’s ahead this week: W9D1 Introduction to Structured Databases I W9D2 Introduction to Structured Databases II W9D3 SQL Practice Pre-Class Content SQL Zoo - Tutorials 0 - 8 Alex the Analyst - Select + From Statements Alex the Analyst - Where Statement Alex the Analyst - Group By + Order By Alex the Analyst - Case Statements Alex the Analyst - Subqueries Microsoft - Database Normalization Basics Assignments [TQZ] Week 9 Pre-Class Content Quiz (LAST ONE!) [TLAB] Weather Data Analysis © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 💻 W9D1 (5/5) Introduction to Structured Databases I: Monday, May 5, 5:30-9:30pm ET Introduction to Structured Databases I Before Class SQL Zoo - Tutorials 0 - 8 Alex the Analyst - Select + From Statements Alex the Analyst - Where Statement Alex the Analyst - Group By + Order By During Class Learning Objectives By the end of this session, fellows will be able to: Create simple tables using SQL and define their structure using basic DDL operations (CREATE, ALTER, RENAME, DROP) Retrieve specific rows or columns from a table using SELECT and WHERE Use aggregate functions (SUM, COUNT, AVG, MIN, MAX) to summarize data Group results using GROUP BY and filter grouped data using HAVING Perform JOINs to combine data across tables Agenda Pandas LeetCode Question (30 minutes) History & Necessity of SQL (30 minutes) Introduction to SQL - DDL Statements (30 minutes) Break (30 minutes) DML & Join Statements (1 hour) SQL Bolt (50 minutes) Wrap-Up (10 minutes) In-Class Assessments SQL Bolt (Lessons 1 - 8) Instructional Materials [Slides] Introduction to Structured Databases I [Notes] SQL Foundations: Guided Exercise on Creating, Querying, and Joining Tables After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 💻 W9D1 (5/5) Introduction to Structured Databases I: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 💻 W9D2 (5/6) Introduction to Structured Databases II: Tuesday, May 6, 5:30-9:30pm ET Introduction to Structured Databases II Before Class Alex the Analyst - Case Statements Alex the Analyst - Subqueries Microsoft - Database Normalization Basics During Class Learning Objectives By the end of this session, fellows will be able to: Write subqueries to filter, summarize, or feed into larger SQL statements Use CASE statements to apply conditional logic in SELECT queries Understand, at a high level, why database normalization helps improve clarity and reduce redundancy Apply all your skills from this week to solve a real-world-style data challenge using SQL Agenda SQL LeetCode Question (30 minutes) SQL Review (30 minutes) Subqueries (30 minutes) Break (30 minutes) Case Statements + Normalization (30 minutes) SQL Murder Mystery (1 hour, 30 minutes) Wrap-Up (10 minutes) In-Class Assessments SQL Bolt (Lessons 9 - 12) SQL Murder Mystery Online SQL Editor Instructional Materials [Slides] Introduction to Structured Databases II [Notes] SQL Day 2: Reasoning with Data – Subqueries, Logic, and Sleuthing After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 💻 W9D2 (5/6) Introduction to Structured Databases II: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 🧪 W9D3 (5/7) SQL Review: Wednesday, May 7, 5:30-9:30pm ET SQL Review Before Class Ensure you have a Leetcode account During Class Learning Objectives By the end of this session, fellows will be able to: Simulate the interview process by asking you to complete and present technical challenges live. Continue working on TLAB #3 Agenda SQL Leetcode Questions (1 hour, 30 minutes) Break (30 minutes) TLAB #3 (1 hour, 50 minutes) Wrap-up (10 minutes) In-Class Assessments [TLAB] Weather API Data Analysis Instructional Materials [Slides] SQL Review [Notes] SQL Practice: Guided Problem Set from LeetCode After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 🧪 W9D3 (5/7) SQL Review: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › 🤖 P1W9 Post Class Summary: Week 9 Post Class Summary NotebookLM podcast summary of the week: This week, we were introduced to SQL and its queries. Next week, we will explore how we can utilize SQL in conjunction with Python to create and query a database. Assignments [TLAB] Weather API Data Analysis (due 5/14) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W9  (5/5-5/9) Introduction to Structured Databases › [TQZ] Week 9 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 💻 W10D1 (5/12) Advanced SQL I: Monday, May 12, 5:30-9:30pm ET Advanced SQL I Before Class Alex the Analyst - Window Functions in MySQL During Class Learning Objectives By the end of this session, fellows will be able to: Use SQL window functions (ROW_NUMBER, RANK, DENSE_RANK, NTILE) to analyze and rank data within partitions. Apply LAG() and LEAD() functions to compare rows across a sequence. Use subqueries to calculate differences between values (e.g., current vs. previous order amounts). Agenda Pandas LeetCode Question (30 minutes) Window Functions Tutorial (60 minutes) Break (30 minutes) Lab Intro + Review (30 Minutes) SQLZoo COVID-19 Exercise (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments SQLZoo: COVID-19 Data Instructional Materials [Slides] Advanced SQL I [Notes] Advanced SQL I: Using Window functions to Partition & Calculated Lagged Values After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 💻 W10D1 (5/12) Advanced SQL I: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 💻 W10D2 (5/13) Advanced SQL II: Tuesday, May 13, 5:30-9:30pm ET Advanced SQL II Before Class SQLite3 Python Tutorial in 5 Minutes During Class Learning Objectives By the end of this session, fellows will be able to: Interpret ERD Diagrams. Connect to a SQLite database using Python. Create a table and insert data into it. Run simple SQL queries from Python to explore data. Print and interpret results returned by the database. Agenda Pandas LeetCode Question (30 minutes) ERD Diagrams (30 minutes) SQLite + Python (30 minutes) Break (30 minutes) Lab Intro + Review (30 Minutes) SQLite Lab (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments SQLite Intro Instructional Materials [Slides] Advanced SQL II [Notes] Advanced SQL II: SQLite & Python After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 💻 W10D2 (5/13) Advanced SQL II: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 💻 W10D3 (5/14) SQL Review II: Wednesday, May 14, 5:30-9:30pm ET SQL Review II Before Class None! During Class Learning Objectives By the end of this session, fellows will be able to: Simulate the interview process by asking you to complete and present technical challenges live. Continue working on TLAB #3 Agenda SQL LeetCode Question (1 hour, 30minutes) Break (30 minutes) TLAB #3 (2 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments Find Follower Count User Activity for the Past 30 Days I Percentage of Users Attended a Contest Students and Examinations Instructional Materials [Slides] SQL Review II [Notes] SQL Practice II: Guided Problem Set from LeetCode After Class Assignments Complete the following by 5/14: [TLAB] Weather API Data Analysis Project Milestone: Develop a project that collects weather data on Minas Gerais and compare to coffee crop outcomes", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 💻 W10D3 (5/14) SQL Review II: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 🧪 W10D4 (5/15) Intro to TEPP: Thursday, May 15, 5:30-7:30pm ET Intro to TEPP Before Class None! During Class Learning Objectives By the end of this session, fellows will be able to: Get introduced to the end of phase project Be placed into teams based on similar interests and select a group leader Learn how to perform a stand-up View a demonstration of committing to the same repository Agenda TEPP Introduction (15 minutes) Team Selection (30 minutes) Team Meeting (30 minutes) Standup Demo (15 minutes) GitHub Demo (30 minutes) In-Class Assessments Team Selection Doc Cohort A: https://forms.gle/fPK11DmxYrgg4vja9 Cohort B: https://forms.gle/k1k6rcpY8X4TMh2VA Instructional Materials [Slides] TEPP Intro Team Norms Stand-Up Format Inviting collaborators to a personal repository Using Git As A Group (DevMountain) Skip any mention of branches", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › 🧪 W10D4 (5/15) Intro to TEPP: . You all will instead be directly committing to the main branch. After Class Assignments Complete the following by 5/21: [TEPP] Phase 1 Portfolio Project Project Milestone: Complete an EDA on a dataset of your choice within a group! © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W10 (5/12-5/16) Advanced SQL  › [TEPP] Phase 1 Portfolio Project (Due 5/25) (Assignment)", "[technical] IF '25 Data Science Cohort A › P1W11 (4/28 - 5/23) End of Phase Project › 💻 W11D1 (5/19) Working Day I: Monday, May 19, 5:30-9:30pm ET Work Day I Before Class None During Class Learning Objectives By the end of this session, fellows will be able to: Form comprehensive analytical questions on a dataset Structure a repository based on readability & reducing cognitive complexity Push code to a shared GitHub repository Complete a stand-up Agenda TEPP Part 1 Intro (30 minutes) TEPP work (3 hours) Stand-Ups (30 minutes) In-Class Assessments None Instructional Materials [Slides] TEPP Part One [Harvard College Writing Center] Asking Analytical Questions [Datacamp] Forming the Analytical Questions After Class Assignments Complete the following by 5/21: [TEPP] Phase 1 Portfolio Project Project Milestone: Complete an EDA on a dataset of your choice within a group! © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W11 (4/28 - 5/23) End of Phase Project › 💻 W11D2 (5/20) Working Day II: Tuesday, May 20, 5:30-9:30pm ET Work Day II Before Class None During Class Learning Objectives By the end of this session, fellows will be able to: Work with a team to apply EDA on a shared dataset to retrieve insights based on analytical questions. Perform stand-ups to inform external team members on group progress. Agenda TEPP Part 2 Intro (30 minutes) TEPP work (3 hours) Stand-Ups (30 minutes) In-Class Assessments None Instructional Materials None After Class Assignments Complete the following by 5/21: [TEPP] Phase 1 Portfolio Project Project Milestone: Complete an EDA on a dataset of your choice within a group! © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P1W11 (4/28 - 5/23) End of Phase Project › 💻 W11D3 (5/21) Working Day III: Wednesday, May 21, 5:30-9:30pm ET Work Day III Before Class None During Class Learning Objectives By the end of this session, fellows will be able to: Work with a team to apply EDA on a shared dataset to retrieve insights based on analytical questions. Perform stand-ups to inform external team members on group progress. Agenda End of Phase Recap (30 minutes) TEPP work (3 hours) Stand-Ups (30 minutes) In-Class Assessments None Instructional Materials None After Class Assignments Complete the following by 5/25: [TEPP] Phase 1 Portfolio Project Project Milestone: Complete an EDA on a dataset of your choice within a group! © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D1 (6/9) Introduction to Phase 2: Monday, June 9, 5:30-9:30pm ET Introduction to Phase 2 Before Class Welcome back! Check out the P2W1 \"Welcome\" package (TO BE POSTED WEDNESDAY) During Class Learning Objectives By the end of this session, fellows will be able to: Understand the structure and assignment schedule of Phase 2 Be informed on proper study practices for Machine Learning Algorithms Answer computational questions on variables, conditionals, loops, and data-structures in Pytho Agenda Phase 2 Introduction (40 minutes) Python & Pandas Review (50 minutes) Break (30 minutes) Lab Introduction (10 minutes) Python Review Lab (1 hour, 40 minutes) Review Lab Answers (10 minutes) In-Class Assessments Python Review Lab Instructional Materials [Slides] Phase 2 Intro & Python Refresher [Notes] Python Review Notebook After Class Assignments Complete the following by 6/20 : [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) Project Milestone: Provide a GitHub link to your TLAB #1 repo", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D1 (6/9) Introduction to Phase 2: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D2 (6/10) Advanced Python Refresher: Tuesday, June 10, 5:30-9:30pm ET Advanced Python Refresher Before Class None! During Class Learning Objectives By the end of this session, fellows will be able to: Understand how you can programmatically request data over the web using the requests module in Python Describe what a Web API is Understand how to interpret a JSON structure in Python Review how to use the bs4 methods to parse an HTML document Agenda Python Review (30 minutes) Web API Review (60 minutes) Break (30 minutes) Web Scraping Review (30 minutes) Web API Lab (1 hour, 20 minutes) Review Lab Answers (10 minutes) In-Class Assessments API & Web-Scraping Review Instructional Materials [Slides] Advanced Python Refresher After Class Assignments Complete the following by 6/20 : [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) Project Milestone: Provide a GitHub link to your TLAB #1 repo", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D2 (6/10) Advanced Python Refresher: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D3 (6/11) SQL Refresher: Wednesday, June 11, 5:30-9:30pm ET SQL Refresher Before Class None During Class Learning Objectives By the end of this session, fellows will be able to: Utilize ERD diagrams to anticipate the JOINS you will use to produce tables in SQL. Implement Python code that utilizes the sqlite3 module in order to query a local database. Agenda Warm Up Question (30 minutes) SQL Review & Subqueries (30 minutes) ERD Diagrams (30 Break (30 minutes) Ridge & Lasso Regression (30 minutes) Lasso & Ridge Lab (1 hour, 20 minutes) Review Lab Answers (10 minutes) In-Class Assessments [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) Instructional Materials [Slides] SQL Refresher After Class Assignments Complete the following by 6/27: [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) Project Milestone: Provide a GitHub link to your TLAB #1 repo", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D3 (6/11) SQL Refresher: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D4 (6/12) Introduction to Linear Regression: Thursday, June 12, 5:30-9:30pm ET Introduction to Linear Regression Before Class Read First ISLP - Chapter 2 - 2.1 ISLP - Chapter 3 - 3.1 Watch After Reading What is Machine Learning - Andrew Ng StatQuest - Linear Regression During Class Learning Objectives By the end of this session, fellows will be able to: Explain the basic idea of machine learning: using data to make predictions Understand how optimization works (finding maxima/minima with derivatives) Describe what RSS (Residual Sum of Squares) means in linear regression Understand how linear regression \"finds the best fit\" using calculus Explain multivariate regression and polynomial regression concepts Agenda Machine Learning - What/When (30 minutes) Optimization via Calculus (30 minutes) Introduction to Linear Regression (15 minutes) Ordinary Least Squares Regression (45 minutes) Multivariate Regression (30 minutes) In-Class Assessments (Complete Outside of Class) DataCamp - Sklearn Linear Regression Create a notebook and implement the listed code within this tutorial", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › 💻 W1D4 (6/12) Introduction to Linear Regression: . Read along with the math concepts, and see if you can relate these concepts to our linear regression lecture from today! Instructional Materials [Slides] Introduction to Linear Regression [Notes] In-Class Review: The Foundations of Linear Regression After Class Assignments Complete the following by 6/20 : [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) Project Milestone: Provide a GitHub link to your TLAB #1 repo. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W1 (6/9-6/13) Python & SQL Review › [TLAB] SQL Ad-Hoc Analysis (Due 6/27) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › 📚 P2W2 Overview & Lesson Plan: Week 2 Overview & Lesson Plan Now that we had a small preview of linear regression, let's learn about the auxiliary concepts and algorithms which allow us to extract even greater performance out of our predictions. This week, we will learn about the concepts of gradient descent and regularization. Even though we are applying these concepts to simple linear regression, we will later see how we can utilize the very same formulae and concepts in advanced topics of neural networks. Here’s an overview of what’s ahead this week: W2D2 Introduction to Error & Regularization W2D3 Hyperparameter Tuning Pre-Class Content Read First ISLP - Chapter 6 - 6.2 IBM - Hyperparameter Tuning Watch After Reading StatQuest - Gradient Descent, Step-by-Step StatQuest - Regularization Ridge (L2) Regression StatQuest - Regularization Lasso (L1) Regression StatQuest - Cross Validation Reddit - Linear Regression Gradient Descent Visualized Assignments [TQZ] P2W2 Pre-Class Content Quiz (Due 6/18) [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › 💻 W2D2 (6/17) Introduction to Error & Regularization: Tuesday, June 17, 5:30-9:30pm ET Introduction to Error & Regularization Before Class Read First ISLP - Chapter 6 - 6.2 Watch After Reading StatQuest - Gradient Descent, Step-by-Step StatQuest - Regularization Ridge (L2) Regression StatQuest - Regularization Lasso (L1) Regression Reddit - Linear Regression Gradient Descent Visualized During Class Learning Objectives By the end of this session, fellows will be able to: Calculate common error metrics (MSE, RMSE, MAE, R²) for regression models Interpret residual plots to assess model fit Apply L1 (LASSO) and L2 (Ridge) regularization to a regression model Compare and interpret how regularization effects model performance Explain why measuring error and applying regularization are important in real-world ML task Agenda Kahoot (20 minutes) Error in Linear Regression (40 minutes) Gradient Descent (30 minutes) Break (30 minutes) Ridge & Lasso Regression (30 minutes) Lasso & Ridge Lab (1 hour, 20 minutes) Review Lab Answers (10 minutes) In-Class Assessments LASSO & Ridge Lab Instructional Materials [Slides] Introduction to Error & Regularization [Notes] In-Class Exercise: Understanding Error & Regularization in Regression After Class Assignments Complete the following by 6/20 : [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) Project Milestone: Provide a GitHub link to your TLAB #1 repo", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › 💻 W2D2 (6/17) Introduction to Error & Regularization: . Additional Resources (Optional) Datacamp - Lasso and Ridge Regression in Python Tutorial © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › 💻 W2D3 (6/18) Hyperparameter Tuning: Wednesday, June 18, 5:30-9:30pm ET Hyperparameter Tuning Before Class Read First IBM - Hyperparameter Tuning Watch After Reading StatQuest - Cross Validation During Class Learning Objectives By the end of this session, fellows will be able to: Split data into training and testing sets using sklearn Understand why we split data and how this helps model generalization Apply Grid Search and Randomized Search to tune hyperparameters Interpret and compare model performance (MSE) with different hyperparameter tuning methods Evaluate the trade-offs between accuracy and computational cost when choosing tuning methods Agenda Pandas Warm Up (30 minutes) Train/Test Split (30 minutes) Hyperparameters (30 minutes) Break (30 minutes) Hyperparameters Review (30 minutes) Lasso & Ridge Lab (1 hour, 20 minutes) Review Lab Answers (10 minutes) In-Class Assessments Hyperparameter Lab Instructional Materials [Slides] Hyperparameter Tuning [Notes] In-Class Exercise: Choosing Hyperparameters with Train/Test Splits & RandomizedSearchCV After Class Assignments Complete the following by 6/20: [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) Project Milestone: Provide a GitHub link to your TLAB #1 repo", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › 💻 W2D3 (6/18) Hyperparameter Tuning: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › 🤖 P2W2 Post Class Summary: Week 2 Post Class Summary Notebook LM podcast summary of the week: This week, were introduced to error metrics in linear regression, gradient descent, and regularization techniques to prevent overfit. Next week, we will learn how we can apply these same concepts in the realm of classification. Extra Resources Datacamp - Lasso and Ridge Regression in Python Tutorial Assignments [TQZ] P2W2 Pre-Class Content Quiz (Due 6/18) [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › [TQZ] P2W2 Pre-Class Content Quiz (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W2 (6/16-6/20) Introduction to Machine Learning › [TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 📚 P2W3 Overview & Lesson Plan: Week 3 Overview & Lesson Plan Congratulations on completing your first full week of machine learning! The previous week marks your first-step in your journey of understanding the \"intelligent\" algorithms that shape much of our world today. In this upcoming week, we learn about another type of prediction task: classification. We use classification algorithms to solve for complex problems such as predicting if a bank-transaction is related to fraud, classifying tumors as benign or malignant, or even recognizing if an image contains a dog. This week, we will learn about the logistic regression algorithm, which operates quite similarly to our linear regressor", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 📚 P2W3 Overview & Lesson Plan: . However this time, instead of simply predicting a continuous value, we will instead predict the \"log-odds\" of a sample belonging to a binary category ( ex: dog vs not dog ), and utilize those log odds to classify if a sample belongs to a group! Here’s an overview of what’s ahead this week: W3D1 Introduction to Logistic Regression W3D2 Logistic Regression Accuracy Metrics W3D3 Feature Engineering Pre-Class Content Read First ISLP - Chapter 4 - 4.1 - 4.3 Watch After Reading StatQuest - Logistic Regression Part 1 StatQuest - Logistic Regression Part 2 StatQuest - The Confusion Matrix Assignments [TQZ] Week 3 Pre-Class Content Quiz (Due 6/25) [TLAB] SQL Ad-Hoc Analysis (Due 6/27) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 💻 W3D1 (6/23) Introduction to Logistic Regression: Monday, June 23, 5:30-9:30pm ET Introduction to Logistic Regression Before Class Read First ISLP - Chapter 4 - 4.1 - 4.3 Watch After Reading StatQuest - Logistic Regression Part 1 StatQuest - Logistic Regression Part 2 During Class Learning Objectives By the end of this session, fellows will be able to: Explain the difference between binary and multi-class classification Understand why linear regression doesn’t work for classification problems Describe the role of the sigmoid function and log-odds in logistic regression Explain how logistic regression uses Maximum Likelihood Estimation (MLE) to estimate coefficients Implement and tune a logistic regression model in sklearn Compare different hyperparameter tuning approaches (RandomizedSearchCV vs", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 💻 W3D1 (6/23) Introduction to Logistic Regression: . GridSearchCV) Agenda Kahoot (20 minutes) Machine Learning Review (10 minutes) Classification Problems (20 minutes) Logistic Regression Theory (40 minutes) Break (30 minutes) Logistic Regression Review (30 minutes) Logistic Regression Lab (50 minutes) Review Lab Answers (10 minutes) In-Class Assessments Logistic Regression Lab Instructional Materials [Slides] Introduction to Logistic Regression [Notes] In-Class Exercise: Logistic Regression & Hyperparameter Tuning After Class Assignments Complete the following by 6/27: [TLAB] SQL Ad-Hoc Analysis (Due 6/27) Project Milestone: Use Python & SQL to generate an ad-hoc report on a database", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 💻 W3D1 (6/23) Introduction to Logistic Regression: . Additional Resources (Optional) Datacamp - Introduction to Logistic Regression © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 💻 W3D2 (6/24) Logistic Regression Accuracy Metrics: Tuesday, June 24, 5:30-9:30pm ET Logistic Regression Accuracy Metrics Before Class Read First ISLP - Chapter 4 - 4.1 - 4.3 Watch After Reading StatQuest - The Confusion Matrix During Class Learning Objectives By the end of this session, fellows will be able to: Train a logistic regression model using scikit-learn. Interpret a confusion matrix and compute: Accuracy, Precision, Recall (Sensitivity), Specificity, F1 Score Visualize and interpret a Receiver Operating Characteristic (ROC) curve. Understand the trade-offs between precision and recall. Agenda Pandas LeetCode Question (30 minutes) Accuracy (60 minutes) Break (30 minutes) ROC Curve (30 minutes) Accuracy Metrics (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments Logistic Regression Accuracy Instructional Materials [Slides] Logistic Regression Accuracy Metrics [Notes] In-Class Exercise: Evaluating and Tuning a Logistic Regression Model After Class Assignments Complete the following by 6/27: [TLAB] SQL Ad-Hoc Analysis (Due 6/27) Project Milestone: Use Python & SQL to generate an ad-hoc report on a database", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 💻 W3D2 (6/24) Logistic Regression Accuracy Metrics: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 💻 W3D3 (6/25) Linear & Logistic Regression Review: Wednesday, June 25, 5:30-9:30pm ET Linear & Logistic Regression Review Before Class W1D4 Introduction to Linear Regression W3D1 Introduction to Logistic Regression During Class Learning Objectives By the end of this session, fellows will be able to: Explain the difference between logistic & linear regression and their respective prediction tasks. Understand the process of creating, training, and testing a machine learning algorithm in sklearn Agenda Warm-up (30 minutes) Linear & Logistic Regression Review (60 minutes) Break (30 minutes) ML Review Complete (30 minutes) TLAB #1 Work (1 hour, 20 minutes) Wrap-Up (10 minutes) In-Class Assessments Previous labs from the last 2 weeks LASSO & Ridge Lab Hyperparameter Lab Logistic Regression Lab Logistic Regression Accuracy Instructional Materials [Slides] Linear & Logistic Regression Review After Class Assignments Complete the following by 6/27: [TLAB] SQL Ad-Hoc Analysis (Due 6/27) Project Milestone: Use Python & SQL to generate an ad-hoc report on a database", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 💻 W3D3 (6/25) Linear & Logistic Regression Review: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › 🤖 P2W3 Post Class Summary: Week 3 Post Class Summary Notebook LM podcast summary of the week: This week, we learned how we can estimate probabilities using logistic regression. Next week, we will explore the other types of classification algorithms which allow us to predict multiple classes (as opposed to binary classes). Extra Resources Datacamp - Introduction to Logistic Regression Assignments [TQZ] P2W4 Pre-Class Content Quiz (Due 6/30) [TLAB] Financial Fraud Detection (Due 7/20) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W3 (6/23-6/27) Classification Algorithms › [TQZ] P2W3 Pre-Class Content Quiz (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W4 (6/30-7/3) Bayes Theorem › 💻 W4D3 (7/2) Bayes Theorem Review: Wednesday, July 2, 5:30-9:30pm ET Bayes Theorem Review Before Class Veritasium - The Bayesian Trap StatQuest - Bayes’ Theorem During Class Learning Objectives By the end of this session, fellows will be able to: Differentiate between supervised and unsupervised learning. Explain strategies for multi-class classification using \"one vs. one\" and \"one vs. all\" approaches. Recall basic probability concepts necessary for understanding model predictions. Understand and apply the principles of Bayes theorem through a \"plug and play\" approach to compute updated hypothesis likelihoods. Count the frequency of words in text to apply them to Bayes Theorem", "[technical] IF '25 Data Science Cohort A › P2W4 (6/30-7/3) Bayes Theorem › 💻 W4D3 (7/2) Bayes Theorem Review: . Agenda Kahoot (20 minutes) Updated Class Structure (10 minutes) Supervised vs Unsupervised Review (30 minutes) One vs One Classification (30 minutes) Break (30 minutes) One vs One Classification (30 minutes) Bayes Theorem Review (60 minutes) Text Analysis (if time) (15 minutes) End of Class Announcements (15 minutes) In-Class Assessments Bayes Theorem & ML Review Code Along Instructional Materials [Slides] Bayes Theorem Review After Class Assignments Complete the following by 7/23: [TLAB] Financial Fraud Detection (Due 7/23) Project Milestone: Use a machine learning classifier to predict when a bank transaction is fraudulent", "[technical] IF '25 Data Science Cohort A › P2W4 (6/30-7/3) Bayes Theorem › 💻 W4D3 (7/2) Bayes Theorem Review: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W4 (6/30-7/3) Bayes Theorem › [TLAB] Financial Fraud Detection (Due 7/23) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 📚 P2W5 Overview & Lesson Plan: Week 5 Overview & Lesson Plan This week, we will expand our knowledge of advanced multi-class classification algorithms, which includes the Naïve Bayes classifier, as well as the kNN (k-Nearest-Neighbors) classifier. Additionally, we will review common issues that arise when applying our learning algorithms to datasets with multiple dimensions (i.e., predictors). We will then conclude this week with an exploration of how we can use feature engineering to solve many of these multi-dimensional issues. Here’s an overview of what’s ahead this week: W5D1 Naïve Bayes Classification W5D2 K-Nearest-Neighbors W5D3 Feature Engineering Pre-Class Content Read First ISLP - Chapter 2 - 2.2.3 ISLP - Chapter 4 - 4.4.4 ISLP - Chapter 6 - 6.4.1 - 6.4.2 Watch After Reading StatQuest - Naive Bayes StatQuest - kNN Assignments [TQZ] Week 5 Pre-Class Content Quiz (Due 7/7) [TLAB] Fraud Detection Checkpoint #1 (Due 7/9) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 💻 W5D1 (7/7) Naive Bayes Classifier: Wednesday, July 2, 5:30-9:30pm ET Bayes Theorem Review Before Class ISLP - Chapter 2 - 2.2.3 ISLP - Chapter 4 - 4.4.4 StatQuest - Naive Bayes During Class Learning Objectives By the end of this session, fellows will be able to: Explain and apply Bayes Theorem within a classification context. Implement a Naive Bayes Classifier using basic Python (without sklearn) to analyze a spam text example. Apply L aplace smoothing to adjust probability estimates when encountering zero counts. Implement a Gaussian Naive Bayes Classifier using sklearn on the iris dataset, including a simple hyperparameter search", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 💻 W5D1 (7/7) Naive Bayes Classifier: . Agenda Pre-Class Material Review (15 minutes) Kahoot (15 minutes) Bayes Theorem Review & the Naive Bayes Classifier (45 minutes) Laplace Smoothing (15 minutes) Break (30 minutes) The \"naïve\" assumption (15 minutes) Gaussian Naïve Bayes Classifier (60 minutes) Implementing Naïve Bayes Classification (30 minutes) End of Class Announcements (15 minutes) In-Class Assessments Naïve Bayes Classifier Code Along Instructional Materials [Slides] Introduction to the Naïve Bayes Classifier After Class Assignments Complete the following by 7/9: [TLAB] Financial Fraud Detection Checkpoint #1 (Due 7/9) Project Milestone: Upload your project template to GitHub", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 💻 W5D1 (7/7) Naive Bayes Classifier: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 💻 W5D2 (7/8) K Nearest Neighbors: Tuesday, July 8, 5:30-9:30pm ET K Nearest Neighbors Before Class ISLP - Chapter 6 - 6.4.1 - 6.4.2 StatQuest - kNN During Class Learning Objectives By the end of this session, fellows will be able to: Understand how to manually compute distance metrics (L1/Manhattan and L2/Euclidean) between data points. Implement the kNN classifier using scikit-learn on both a toy dataset and the iris dataset. Learn how to iteratively tune the hyperparameter k by comparing train/test accuracy. Explore the effect of feature scaling on model performance by applying scaling techniques (e.g., MinMax scaling). Investigate common machine learning challenges such as the curse of dimensionality and class imbalance, and learn techniques (like SMOTE) to address them", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 💻 W5D2 (7/8) K Nearest Neighbors: . Agenda Warm-up (30 minutes) kNN Introduction (60 minutes) Break (30 minutes) Search for best Hyperparameters (45 minutes) Curse of Dimensionality & Class Imbalance (45 minutes) End of Class Announcements (15 minutes) In-Class Assessments knn.zip Instructional Materials [Slides] Introduction to K-Nearest-Neighbors After Class Assignments Complete the following by 7/9: [TLAB] Financial Fraud Detection Checkpoint # 1(Due 7/9) Project Milestone: Upload your project template to GitHub. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 💻 W5D3 (7/9) Feature Engineering: Thursday, July 9, 5:30-9:30pm ET Feature Engineering Before Class None! During Class Learning Objectives By the end of this session, fellows will be able to: Understand what constitutes “good” data by learning how to inspect data quality, consistency, and formatting. Learn how to identify and clean data issues such as duplicates and missing values using pandas library. Practice data normalization and transformation techniques so that raw data can be prepared for machine learning models. Apply feature engineering techniques, including adding, removing, and modifying features, to enhance model performance", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › 💻 W5D3 (7/9) Feature Engineering: . Implement encoding methods (one‐hot and dummy encoding) to convert categorical variables into numerical form. Agenda Identify \"Good\" Datasets (30 minutes) Data Wrangling & Normalization Techniques (60 minutes) Break (30 minutes) Feature Engineering & One-Hot Encoding (60 minutes) TLAB #2 Work (60 minutes) In-Class Assessments Feature Engineering Code-Along Instructional Materials [Slides] Feature Engineering After Class Assignments Complete the following by 7/0: [TLAB] Financial Fraud Detection Checkpoint #1 (Due 7/9) Project Milestone: Upload your project template to GitHub. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › [TQZ] P2W5 Pre-Class Content Quiz (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W5 (7/7-7/11) Advanced Classification › [TLAB] Financial Fraud Detection Checkpoint #1 (Due 7/9) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › 📚 P2W6 Overview & Lesson Plan: Week 6 Overview & Lesson Plan Last week we learned about a generative classifier that \"learns\" the probability distributions of words according to specific classes in order to predict if a new text belongs to the \"not spam\" or \"spam\" category. This week, we will continue our review of discriminative classifiers that learns optimal decision boundaries between multiple classes. Here’s an overview of what’s ahead this week: W6D1 Support Vector Machines W6D2 Decision Trees W6D3 Ensemble Learning Pre-Class Content Visual Resources StatQuest - SVM Part 1 StatQuest - SVM Part 2 Kernel Trick (Visually Explained) StatQuest - Bootstrapping StatQuest - Decision Tree & Gini Impurity StatQuest - Random Forests Reading Material IBM - Bagging Springer Textbook ISLP - Chapter 9 - 9.1 ISLP - Chapter 8 - 8.1.1 - 8.1.4 ISLP - Chapter 8 - 8.2.1 - 8.2.3 Assignments [TQZ] Week 6 Pre-Class Content Quiz (Due 7/14) [TLAB] Fraud Detection Checkpoint #2 (Due 7/18) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › 💻 W6D1 (7/14) Support Vector Machines: Monday, July 14, 5:30-9:30pm ET Support Vector Machines Before Class ISLP - Chapter 9 - 9.1 StatQuest - SVM Part 1 StatQuest - SVM Part 2 Kernel Trick (Visually Explained) During Class Learning Objectives By the end of this session, fellows will be able to: Understand the fundamentals of linear algebra by creating and manipulating vectors and matrices with numpy. Perform basic linear algebra operations such as the dot product and matrix transposition. Implement a linear support vector classifier (SVC) using sklearn and evaluate its performance on a simple dataset. Explore non-linear classification using SVMs and learn how the kernel trick transforms data for non-linear decision boundaries", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › 💻 W6D1 (7/14) Support Vector Machines: . Agenda Kahoot (15 minutes) Pre-Class Material Review (15 minutes) Support Vector Machine & Linear Algebra Basics (60 minutes) Break (30 minutes) The Soft-Margin (30 minutes) Support Vector Machines & the Kernel Trick (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments Support Vector Machines Code Along Instructional Materials [Slides] Introduction to Support Vector Machines After Class Assignments Complete the following by 7/18: [TLAB] Financial Fraud Detection Checkpoint #1 (Due 7/18) Project Milestone: Complete your EDA. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › 💻 W6D2 (7/15) Decision Trees: Tuesday, July 15, 5:30-9:30pm ET Decision Trees Before Class ISLP - Chapter 8 - 8.1.1 - 8.1.4 StatQuest - Decision Tree & Gini Impurity During Class Learning Objectives By the end of this session, fellows will be able to: Represent a simple decision tree using Python dictionaries and understand its structure. Calculate and interpret Gini impurity to assess node purity in decision trees. Build a decision tree classifier using sklearn and evaluate its performance through cross-validation. Explore model variance by experimenting with different decision trees Agenda Warm Up (30 minutes) Akinator Demo (10 minutes) Introduction to Trees (30 minutes) Introduction to Decision Trees (20 minutes) Break (30 minutes) Gini & Entropy (30 minutes) Decision Trees Code-Along (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments Decision Trees Code Along Instructional Materials [Slides] Introduction to Decision Trees After Class Assignments Complete the following by 7/18: [TLAB] Financial Fraud Detection Checkpoint #1 (Due 7/18) Project Milestone: Complete your EDA", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › 💻 W6D2 (7/15) Decision Trees: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › 💻 W6D3 (7/16) Bagging & Boosting Trees: Wednesday, July 16, 5:30-9:30pm ET Bagging & Boosting Trees Before Class StatQuest - Random Forests IBM - Bagging ISLP - Chapter 8 - 8.2.1 - 8.2.3 During Class Learning Objectives By the end of this session, fellows will be able to: Understand the core concepts behind ensemble learning, including techniques such as bootstrapping (bagging), Random Forests, and boosting (AdaBoost) Develop the ability to interpret feature importance rankings and understand the bias–variance tradeoff in model evaluation. Challenge yourself by tweaking parameters (like sample size, number of trees, or test split ratio) to observe real–time changes in model outputs", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › 💻 W6D3 (7/16) Bagging & Boosting Trees: . Agenda Bagged Trees & Random Forests (45 minutes) Boosted Trees (45 minutes) Break (30 minutes) Random Forests Review (30 minutes) Classification Challenge (1 hour, 15 minutes) Review & End of Class Announcements (15 minutes) In-Class Assessments Random Forests Code-Along Classification Challenge (Due 7/16) Instructional Materials [Slides] Random Forests After Class Assignments Complete the following by 7/18: [TLAB] Financial Fraud Detection Checkpoint #1 (Due 7/18) Project Milestone: Complete your EDA. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › [TQZ] P2W6 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › [Mini TLAB] Machine Learning Competition Lab on Customer Churn (Due 7/19) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W6 (7/14-7/18) Advanced Classification II › [TLAB] Financial Fraud Detection Checkpoint #2 (Due 7/18) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › 📚 P2W7 Overview & Lesson Plan: Week 7 Overview & Lesson Plan This week, we will begin our exploration of neural networks, which will eventually lead us to the cutting-edge generative models currently being employed to augment human productivity in the workplace. First, we will understand how we can utilize the blessing of non-uniformity to handle multi-dimensional datasets. Next we will learn exactly what an \"unsupervised\" machine learning model is, and how neural networks allow us to perform unsupervised learning on our dataset. Here’s an overview of what’s ahead this week: W7D1 Machine Learning Case Study & Review W7D2 Dimensionality Reduction W7D3 Unsupervised Learning Algorithms Pre-Class Content Visual Resources 3blue1brown - Eigenvectors & Eigenvalues StatQuest - Principal Component Analysis Victor Lavrenko - PCA Part 1 Victor Lavrenko - PCA Part 2 StatQuest - K-Means Clustering Springer Textbook ISLP - Chapter 6 - 6.3.1 - 6.3.2 ISLP - Chapter 12 - 12.4.1 - 12.4.2 Assignments [TQZ] Week 7 Pre-Class Content Quiz (Due 7/21) [TLAB] Financial Fraud Detection (Due 7/23) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › 💻 W7D1 (7/21) Machine Learning Case Study & Review: Monday, July 21, 5:30-9:30pm ET Machine Learning Review Before Class None During Class Learning Objectives By the end of this session, fellows will be able to: Complete a Machine Learning case study and utilize all lessons learned from previous classes. Agenda Kahoot (15 minutes) Pre-Class Material Review (15 minutes) Machine Learning Case Study - EDA (60 minutes) Break (30 minutes) Machine Learning Case Study - Data Transformations (45 minutes) Machine Learning Case Study - Prediction & Dashboarding (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments Machine Learning Rental Case Study Instructional Materials [Slides] Machine Learning Review & Case Study After Class Assignments Complete the following by 7/23: [TLAB] Financial Fraud Detection (Due 7/23) Project Milestone: Train a machine learning algorithm to identify fraudulent transactions by going through idiomatic exploratory data analysis & data transformations", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › 💻 W7D1 (7/21) Machine Learning Case Study & Review: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › 💻 W7D3 (7/23) Unsupervised Learning Algorithms: Wednesday, July 23, 5:30-9:30pm ET Unsupervised Learning Algorithms Before Class StatQuest - K-Means Clustering ISLP - Chapter 12 - 12.4.1 - 12.4.2 During Class Learning Objectives By the end of this session, fellows will be able to: Understand the concept of unsupervised learning and its applications in real-world tasks such as customer segmentation and recommendation systems. Explain the K-Means clustering algorithm in sklearn, including how to choose optimal “K” using the elbow method and other metrics. Implement helper functions to compute distances, assign clusters, and update centroids using basic Python and numpy", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › 💻 W7D3 (7/23) Unsupervised Learning Algorithms: . Integrate these functions into a complete K-Means algorithm that iterates until convergence. Reflect on algorithm behavior and parameter choices (e.g., initial random assignments, number of clusters, convergence criteria). Agenda Introduction to Unsupervised Learning (45 minutes) K-Means Clustering Intro & Code-Along (45 minutes) Break (30 minutes) K-Means Review (30 minutes) Complete TLAB #2 (1 hour, 15 minutes) End of Class Announcements (15 minutes) In-Class Assessments Kmeans & Music Recommendation Code-Along Instructional Materials [Slides] Introduction to Unsupervised Learning Algorithms After Class Assignments Complete the following by 7/23: [TLAB] Financial Fraud Detection (Due 7/23) Project Milestone: Train a machine learning algorithm to identify fraudulent transactions by going through idiomatic exploratory data analysis & data transformations", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › 💻 W7D3 (7/23) Unsupervised Learning Algorithms: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › [TQZ] P2W7 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W7 (7/21-7/25) Unsupervised Learning › [Mini TLAB] Machine Learning Code-Along (Due 7/22) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 📚 P2W8 Overview & Lesson Plan: Week 8 Overview & Lesson Plan What lies at the center of our intelligence/consciousness? If you're a dualist , you believe that our material body is connected to some immaterial phenomenon that gives us the ability to perform tasks reserved for a self-perceiving being. On the other hand if you're a materialist , you believe that the \"stuff\" our body is composed of (aka our cells) dictates our mental states & consciousness. And if you're a pan-psychist , you believe that the quality of intelligence is a \"ubiquitous feature of reality.\" That is, everything that surpasses some threshold of complexity is a conscious/intelligent being", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 📚 P2W8 Overview & Lesson Plan: . So while the brain is conscious, so is slime mold , a turtle, a computer, the Sun, the Milky Way Galaxy, and the Universe. Whichever school of thought we subscribe to, one unifying sentiment is that the neurons in our brain probably play a pretty large role in our conscious experience. Frank Rosenblatt , a New Rochelle native & Cornell Researcher, took this idea further in 1960 by generating a mathematical model that simulates the functions of a neuron and \"learns\" how to recognize categories of data. At its' heart, this is no different than the classifiers that we've discussed over the past few weeks (logistic regressors, SVM's, DT's)", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 📚 P2W8 Overview & Lesson Plan: . However, as we will see this week, this tiny mathematical model lies at the heart of deep learning and allows us to create cutting-edge algorithms that perform tasks such as: Playing Super Mario World Driving a car Physically selecting & sorting items Doing parkour! Take a moment to congratulate yourselves. You have reached (the summit of) the peak of data science. Next up is generative Artificial Intelligence. Here’s an overview of what’s ahead this week: W8D1 Principal Component Analysis W7D2 Neural Networks W7D3 Keras Interactive Lab Pre-Class Content Visual Resources StatQuest - Neural Nets 3blue1brown - But what is a neural network? 3blue1brown - Gradient Descent, How Neural Networks Learn Springer Textbook ISLP - Chapter 10 - 10.1 Assignments [TQZ] Week 8 Pre-Class Content Quiz (Due 7/29) [TLAB] Music Recommendation Dashboard (Due 8/10) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 💻 W8D1 (7/28) Dimensionality Reduction: Monday, July 28, 5:30-9:30pm ET Principal Component Analysis Before Class 3blue1brown - Eigenvectors & Eigenvalues StatQuest - Principal Component Analysis Victor Lavrenko - PCA Part 1 Victor Lavrenko - PCA Part 2 ISLP - Chapter 6 - 6.3.1 - 6.3.2 During Class Learning Objectives By the end of this session, fellows will be able to: Understand and perform basic vector operations using numpy , including calculating dot products, Euclidean norms, and cosine similarity. Manually implement Principal Component Analysis (PCA) by computing eigenvalues and eigenvectors, then sorting and projecting data onto principal components", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 💻 W8D1 (7/28) Dimensionality Reduction: . Utilize sklearns PCA for dimensionality reduction and compare it with a manual approach. Explore alternative dimensionality reduction techniques (t-SNE) and visualize high-dimensional data. Agenda Kahoot (15 minutes) Pre-Class Material Review (15 minutes) Linear Algebra Review (60 minutes) Break (30 minutes) Applied Principal Component Analysis (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments PCA Code Along Instructional Materials [Slides] Dimensionality Reduction with PCA After Class Assignments None for now! We'll be completing TLAB #3 together as a class next week", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 💻 W8D1 (7/28) Dimensionality Reduction: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 💻 W8D2 (7/29) Introduction to Neural Networks: Tuesday, July 29, 5:30-9:30pm ET Introduction to Neural Networks Before Class StatQuest - Neural Nets 3blue1brown - But what is a neural network? 3blue1brown - Gradient Descent, How Neural Networks Learn ISLP - Chapter 10 - 10.1 During Class Learning Objectives By the end of this session, fellows will be able to: Understand how a basic perceptron works and how to implement it using numpy. Learn how to compute the perceptron output and apply an activation function (Heaviside step function). Practice updating model parameters using full‐batch, mini‐batch, and stochastic gradient descent. Build a simple feed-forward neural network with Keras and understand its architecture", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 💻 W8D2 (7/29) Introduction to Neural Networks: . Agenda Pre-Class Review (15 minutes) Neural Networks - Perceptron & Network Introduction (1 hour, 15 minutes) Break (30 minutes) Applied Neural Network Exercise (1 hour) End of Class Announcements (15 minutes) In-Class Assessments Neural Networks Code Along Instructional Materials [Slides] Introduction to Neural Networks After Class Assignments None for now! We'll be completing TLAB #3 together as a class next week. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 💻 W8D3 (7/30) Keras Lab Session: Wednesday, July 30, 5:30-9:30pm ET Keras Fashion Classification Before Class All resources below are just to get you thinking about novel applications of computer vision models: data, but make it fashion Reshaping fashion with Computer Vision & AI I am using AI to automatically drop hats onto New Yorkers During Class Learning Objectives By the end of this session, fellows will be able to: Implement a vision algorithm with at least 90% testing accuracy in Keras to accurately identify articles of clothing within a 28 x 28 pixel grey-scale image. Deploy a machine learning algorithm within a streamlit dashboard to extract clothing item classifications out of images", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › 💻 W8D3 (7/30) Keras Lab Session: . Agenda Linear Algebra & PCA Review (30 minutes) Neural Network Review (60 minutes) Break (30 minutes) Fashion MNIST Code-Along (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments Fashion Classification Challenge Instructional Materials Keras Tutorial Basics Concepts of Streamlit After Class Assignments None for now! We'll be completing TLAB #3 together as a class next week. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W8 (7/28 - 8/1) Introduction to Neural Networks › [TQZ] P2W8 Pre-Class Content Quiz (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 📚 P2W9 Overview & Lesson Plan: Week 9 Overview & Lesson Plan Philosophy Warning : We're going to get into some non-empirical philosophy that can neither be proved or disproved in the next paragraph, so bear with us for just one moment before we bring this back to the world of data analytics/science. Where does the number 6 exist? Is it purely a mathematical concept that humans have invented, or is this an idea or \"form\" that permeates all of reality. Or, to bring this to a more practical example, how about the concept of a \"dog?\" Of course there are hundreds of millions of different types of physical dogs all over the world, but what is the \"essence\" of the idea of a dog? That is, when you think about a dog, you're not necessarily thinking about a specific dog, but rather you are interacting with some abstract concept of a dog that fulfills some essential attributes and behaviors", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 📚 P2W9 Overview & Lesson Plan: . Maybe how this dog looks or behaves is dependent on your upbringing (i.e. American dogs say \"Woof woof\" but Hungarian dogs say \"Vau Vau\"), but it's behavior is still bound by some \"dogness.\" What comes to mind when you think of a \"dog\"? What we're discussing here is Plato's Theory of Forms . The following excerpt from Wikipedia best summarizes our intended application of this idea: \"Plato's Socrates held that the world of Forms is transcendent to our own world (the world of substances) and also is the essential basis of reality. Super-ordinate to matter, Forms are the most pure of all things", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 📚 P2W9 Overview & Lesson Plan: . Furthermore, he believed that true knowledge/intelligence is the ability to grasp the world of Forms with one's mind.\" Now, take this next sentence with a grain of salt, but it turns out that the previous 2 decades of AI development have actually led us to a tool which approximates this idea of a concept taking on some sort of essential \"form\" which transcends all physical manifestations. What we're discussing here are vector embeddings . Berlin is to Germany, as to what Madrid is to Spain! A vector embedding is a numeric representation of a piece of data, as it is seen through a neural network", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 📚 P2W9 Overview & Lesson Plan: . This week, we will take a deep dive into the world of vector embeddings and how we can apply them to domains of text, audio, and image analysis to extract information. While this domain is by no means new, it is experiencing its' own renaissance with the surge in applied AI technologies. Since we've already given you a paragraph to read within the pre-class page, today's pre-class content will solely be video/article-based. Please keep up with these readings! These next few weeks are imperative for your success in starting the journey of becoming an AI professional that can sufficiently apply these novel technologies", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 📚 P2W9 Overview & Lesson Plan: . Here’s an overview of what’s ahead this week: W9D1 NLP & Vector Embeddings W9D2 The Transformer Architecture W9D3 Hugging Face Pipeline Pre-Class Content Articles A visual introduction to vector embeddings LLM Embeddings Explained: A Visual and Intuitive Guide Tensorflow - word2vec OpenAI - Vector Embeddings Transformer Architecture Visually Explained Videos What is a Word Embedding Assignments [TQZ] Week 9 Pre-Class Content Quiz (Due 8/6) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 💻 W9D1 (8/4) Vector Embeddings: Monday, August 4, 5:30-9:30pm ET Vector Embeddings Before Class Articles A visual introduction to vector embeddings LLM Embeddings Explained: A Visual and Intuitive Guide Tensorflow - word2vec OpenAI - Vector Embeddings Videos What is a Word Embedding During Class Learning Objectives By the end of this session, fellows will be able to: Describe what Natural Language Processing (NLP) is and explain how it allows us to extract structure and meaning from raw text data. Apply simple NLP techniques like Bag-of-Words and TF-IDF to transform text into numerical representations for basic analysis and comparison.", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 💻 W9D1 (8/4) Vector Embeddings: . Explain the concept of vector embeddings and how they improve upon classical NLP techniques by capturing the contextual and semantic relationships between words Understand how models like Word2Vec learn word meaning from context and visualize how these embeddings represent abstract ideas in a shared semantic space. Agenda Kahoot (15 minutes) Pre-Class Material Review (15 minutes) NLP Introduction (60 minutes) Break (30 minutes) Vector Embeddings Exploration (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments Word2Vec Code-Along Data (Download Me for Code-Along) Instructional Materials [Slides] Vector Embeddings After Class Assignments Complete the following by 8/6: [TQZ] Week 9 Pre-Class Content Quiz (Due 8/6) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 💻 W9D2 (8/5) Transformer Architecture: Tuesday, August 5, 5:30-9:30pm ET Transformer Architecture Before Class Articles Transformer Architecture Visually Explained Videos Transformers, the tech behind LLMs During Class Learning Objectives By the end of this session, fellows will be able to: Describe how earlier neural network architectures like LSTMs process sequential data , and recognize their limitations in modeling long-range dependencies. Explain the concept of the attention mechanism and how it allows neural networks to focus on important parts of input sequences. Understand the key innovation behind transformers , processing all input tokens in parallel using attention, and how this enables scaling to large datasets Recognize how transformers serve as the foundation for modern Large Language Models (LLMs) and why they outperform previous models in a variety of domains", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 💻 W9D2 (8/5) Transformer Architecture: . Agenda Pre-Class Material Review (30 minutes) Transformer Architecture (60 minutes) Break (30 minutes) Ch2 - Preparing Data for Transformers (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments Ch2 - LLMs from Scratch - Data Preparation Colab in-case Jupyter doesn't work Instructional Materials [Slides] Review of Transformer Architecture After Class Assignments Complete the following by 8/6: [TQZ] Week 9 Pre-Class Content Quiz (Due 8/6) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 💻 W9D3 (8/6) HuggingFace Pipeline: Wednesday, August 6, 5:30-9:30pm ET HuggingFace Pipelines Before Class Articles Getting Started with HuggingFace During Class Learning Objectives By the end of this session, fellows will be able to:. Use Hugging Face’s Wav2Vec2Processor and Data2VecAudioModel to extract fixed-size audio embeddings. Apply PCA for dimensionality reduction and create EDA visualizations (scatterplots, boxplots, heatmaps) to explore genre clusters and outliers. Fit and serialize a KMeans clustering model on embeddings, then load it in Streamlit for interactive, cohort-based song recommendations. Understand and import open-weight model customizations", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › 💻 W9D3 (8/6) HuggingFace Pipeline: . Agenda Hugging Face Demo (60 minutes) Break (30 minutes) Vector Embedding Lab (90 minutes) In-Class Assessments Music Recommendation Mini-TLAB Instructional Materials Hugging Face Code-Along Colab Copy After Class Assignments Complete the following by 8/6: [TQZ] Week 9 Pre-Class Content Quiz (Due 8/6) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › [TQZ] P2W9 Pre-Class Content Quiz  (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W9 (8/4-8/8) NLP Foundations & Transformers › [Mini TLAB] Music Recommendation Lab (Due 8/9) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 📚 P2W10 Overview & Lesson Plan: Week 10 Overview & Lesson Plan Now that we have an understanding of what vector embeddings are, how embeddings could be generated, and how we can import open large-language-model weights onto our local machines, let's explore the current applications of these solutions in the context of enterprise. Some of us may have already used LLM applications through a simple chat-interface, but think about all the limitations this imposes on a company that is trying to optimize workflow/automate communication through language models. Particularly if a company is interested in... protecting the privacy of chat logs, embedding contextual knowledge of company-specific products or services, steering responses towards a particular tone, mood, or solution", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 📚 P2W10 Overview & Lesson Plan: . ...simply plugging queries into an API will not satisfy these needs. For these reasons, this week we will explore how we can set up vector databases and customize our local LLM models though retrieval augmented generation and fine-tuning. This week, we will skip the pre-class quiz, but be sure to read all posted content so that you could utilize these novel technologies to solve a variety of business problems. Here’s an overview of what’s ahead this week: W10D1 Vector Databases & Retrieval Augmented Generation (RAGs) W10D2 Fine-Tuning & Advanced Prompting W10D3 AI Consulting Case-Study Pre-Class Content Articles Vector Embeddings Retrieval Augmented Generation & Semantic Search Chain of Thought Prompting RAG vs Fine-Tuning Fine-Tuning GPT 2 With Hugging Face Assignments None © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 💻 W10D1 (8/11) Vector Databases & Retrieval Augmented Generation (RAGs): Monday, August 11, 5:30-9:30pm ET Vector Databases & RAGs Before Class Articles Vector Embeddings Retrieval Augmented Generation & Semantic Search Videos A Helping Hand for LLMs (Retrieval Augmented Generation) During Class Learning Objectives By the end of this session, fellows will be able to: Understand the purpose of a retrieval step in RAG and how it filters a knowledge base down to relevant facts. Interpret cosine similarity scores to determine which facts are semantically closer to a query. Demonstrate how FAISS indexes and searches vectors using cosine similarity or inner product. Implement a simple semantic search workflow : encode query and facts, compute similarity, and return the top matches", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 💻 W10D1 (8/11) Vector Databases & Retrieval Augmented Generation (RAGs): . Utilize openai to add files to vector stores and augment output with contextual information. Agenda Kahoot (15 minutes) Vector Databases & RAGs Code-Along (1 hour, 15 minutes) Break (30 minutes) RAG Case Study (1 hour, 30 minutes) End of Class Announcements (15 minutes) In-Class Assessments RAG Case-Study Colab Instructional Materials [Slides] Vector Databases & Retrieval Augmented Generation (RAGs) Colab After Class Assignments None for the time being. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 💻 W10D2 (8/12) Fine-Tuning: Tuesday, August 12, 5:30-9:30pm ET Fine-Tuning Before Class Articles Fine-tuned Small LLMs Can Beat Large Ones at 5-30x Lower Cost with Programmatic Data Curation OpenAI - Model Optimization During Class Learning Objectives By the end of this session, fellows will be able to: Understand the purpose of fine-tuning and how it differs from pretraining and RAG (Retrieval Augmented Generation). Prepare a domain-specific dataset in JSONL format suitable for causal language modeling tasks. Tokenize text data for GPT-style models using the Hugging Face AutoTokenizer with correct padding and truncation settings", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 💻 W10D2 (8/12) Fine-Tuning: . Configure and run the Hugging Face Trainer to fine-tune an open-weight model ( distilgpt2 ). Generate predictions from the fine-tuned model using test prompts and the generate() method. Agenda Pre-Class Content Review (30 minutes) Transformer Review (1 hour) Break (30 minutes) Fine-Tuning Code-Along (1 hour, 30 minutes) End of Class Announcements (15 minutes) In-Class Assessments None Instructional Materials Fine-Tuning Code-Along Colab After Class Assignments None for the time being. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 💻 W10D3 (8/13) AI Tools Case-Study: Wednesday, August 13, 5:30-9:30pm ET AI Tools Case-Study Before Class None! During Class Learning Objectives By the end of this session, fellows will be able to: Scope the problem and users; define target outputs, MVP behaviors, and success metrics (accuracy, latency, cost). Choose and justify approach—RAG vs Vector DB vs fine-tuning—based on data volatility, specificity, update cadence, and constraints. Design the end-to-end pipeline (ingest→clean/chunk→embed/index or train→retrieve/rank→generate) and ship an MVP demo (CLI/notebook/web) with clear UX. Agenda Vector DB's, RAGs, Fine-Tuning Review (30 minutes) Prompt Introductions (10 minutes) AI Tooling Work (50 minutes) Break (30 minutes) AI Tooling Work (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments Choose from one of these prompts Resource Recommender Student Interactions Cert Analyzer Feedback Insight Finder Instructional Materials None After Class Assignments None for the time being", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › 💻 W10D3 (8/13) AI Tools Case-Study: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › [W10D4] Important Reminder: Prometheus Capstone Info Session: Thursday, August 14th, 5:30 PST/8:30 EST Prometheus Info Session Important Reminder Event: Prometheus<>TKH Info Session Date: August 14th, 2025 Time: 5:30 PST/8:30 EST Zoom Link: Click Here As you enter Phase 3 of the Innovation Fellowship, you’ll bring everything you’ve learned to life through your Capstone Project — a culminating, portfolio-ready experience designed to showcase your skills, creativity, and readiness for the workforce. Whether you're building a product, analyzing data, or designing a system, your capstone is your chance to simulate the kind of real-world projects you’ll encounter on the job", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › [W10D4] Important Reminder: Prometheus Capstone Info Session: . Real-World Impact: Prometheus Capstone Projects This year, select fellows from the Data Science and Web Development tracks will have the exciting opportunity to collaborate directly with real nonprofits on real problems , thanks to our partnership with Prometheus . Prometheus connects social impact organizations with tech talent to build solutions that make a difference — and you could be that talent . These projects are an incredible way to: Gain real-world experience employers love to see Work on a live product with real stakeholders Build your network across sectors Learn how to navigate team dynamics and client relationships Who's Eligible? Roughly 30 fellows per track (Data Science and Web Development) will be selected to participate in Prometheus projects", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › [W10D4] Important Reminder: Prometheus Capstone Info Session: . Capstone teams will consist of 5 fellows , a Technical Project Manager from Prometheus , and a nonprofit client. To be recommended for a Prometheus project, you must: Be in good standing by the end of Phase 2 (GPA ≥ 75%, Attendance ≥ 90%) Show strong collaboration and communication skills Consistently demonstrate active engagement and participation in class sessions through remainder of Phase 2 (and continue doing so throughout Phase 3) Attend the required Info Session on Thursday, August 14th at 8:30 PM EST / 5:30 PM PST: ZOOM LINK FOR INFO SESSION (Throughout Phase 3) Be available for: 30-minute weekly standups during business hours with your Technical PM Monthly client meetings during business hours Regular class sessions and capstone collaboration time What if I’m not in a Prometheus group? All fellows will complete a capstone! Those not working on Prometheus projects will take on a thoughtfully designed project that mirrors real-world work and still gives you a standout portfolio piece to show employers", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › [W10D4] Important Reminder: Prometheus Capstone Info Session: . © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W10 (8/11-8/15) Applied LLM Techniques › Prometheus Interest Form: Due August 21st (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W11 (8/18-8/22) Agents & End of Phase Project › 💻 W11D1 (8/18) Applied LLM Review & AI Agents: Monday, August 18, 5:30-9:30pm ET Applied LLM Review & AI Agents Before Class AI Criticism The Illusion of Thinking Critique on the Illusion of Thinking Measuring the Impact of Early-2025 AI MIT Reports: 95% of generative AI pilots at companies are failing Companies are Pouring Billions into A.I. It has Yet to Pay Off. During Class Learning Objectives By the end of this session, fellows will be able to: Understand what AI Agents are and how they differ from standalone LLMs. Explain how RAG enhances factual accuracy by grounding responses in external knowledge. Demonstrate how agents can orchestrate between direct generation and RAG-based retrieval", "[technical] IF '25 Data Science Cohort A › P2W11 (8/18-8/22) Agents & End of Phase Project › 💻 W11D1 (8/18) Applied LLM Review & AI Agents: . Implement a simple agent that decides when to query a vector database. Recognize the advantages of combining agents with RAG (flexibility, accuracy, extensibility). Agenda Kahoot (15 minutes) Applied LLM Review (1 hour, 15 minutes) Break (30 minutes) AI Agent Code-Along (60 minutes) End of Class Announcements (15 minutes) In-Class Assessments LLM Agents Colab Instructional Materials [Slides] Applied LLMS & Agents After Class Assignments None for the time being. © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W11 (8/18-8/22) Agents & End of Phase Project › 💻 W11D2 (8/19) TEPP Working Day 1: Tuesday, August 19, 5:30-9:30pm ET TEPP Working Day 1 Before Class AI Criticism The Illusion of Thinking Critique on the Illusion of Thinking Measuring the Impact of Early-2025 AI MIT Reports: 95% of generative AI pilots at companies are failing Companies are Pouring Billions into A.I. It has Yet to Pay Off. During Class Learning Objectives By the end of this session, fellows will be able to: Understand the project deliverables for TEPP Phase 2 Agenda TEPP Introduction & Group Formation (1 hour, 30 minutes) Break (30 minutes) Group work (2 hours) In-Class Assessments None Instructional Materials None After Class Assignments Complete the following by 8/20: [TEPP] Phase 2 Portfolio Project Checkpoint #1 (Due 8/20) © 2025 The Knowledge House | All Rights Reserved", "[technical] IF '25 Data Science Cohort A › P2W11 (8/18-8/22) Agents & End of Phase Project › [TEPP] Phase 2 Portfolio Project (Due 8/29) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W11 (8/18-8/22) Agents & End of Phase Project › [TEPP] Phase 2 Portfolio Project Checkpoint #1 (Due 8/20) (Assignment)", "[technical] IF '25 Data Science Cohort A › P2W12 (8/25 - 8/29) End of Phase Project Week › [TEPP] Phase 2 Portfolio Project Checkpoint #2 (Due 8/27) (Assignment)", "[career] IF '25 NY Career Readiness and Success › Fellow Resources › Fellow Success Resources: Student Success Resources Type Description Link to resource Student Success Specialist Contact Information This spreadsheet has information on updated contact information for your student success specialist team. (emails, booking links, and phone numbers) Contact Information Innovation Fellowship Student Success Handbook This handbook has information about best practices, expectations, and policies related to the Innovation Fellowship. IF '25 Student Success Handbook Innovation Fellowship Student Success Calendar (LIVE) Student Success Calendar provides program dates for when Phases start and end, holidays/NO CLASS, events, and when incentives will be distributed", "[career] IF '25 NY Career Readiness and Success › Fellow Resources › Fellow Success Resources: . IF '25 Student Success Calendar Student Success Portal The Student Success Portal offers community-based support and self-help resources to help students overcome obstacles and stay on track to complete their programs. It connects students with the tools and network they need to succeed. Student Success Portal Support Service Request Form Alert the Student Success Team that you need support. This includes things like mental health resources, access to internet services, caregiver support, and more. This form is also utilized to request need-based funds, flexible learning accommodations, and soft-skill coaching", "[career] IF '25 NY Career Readiness and Success › Fellow Resources › Fellow Success Resources: . Support Services Request Form Technical Equipment Support/Request Alert the Operational Team that you have a technical support need. This includes things like access to a laptop and set-up, IT support, etc. TKH Fellow IT Request form Incident Report Please alert the TKH leadership team that you had an incident with a TKH staff member, volunteer, or peer. Incident Form", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Option 1 - Weekly Job Applications & Progress Report (Due August 30) (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Watch Hackathon Video (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Upwardly Global Learning Paths: Tech Market/Resume/Cover Letter (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Draft Resume (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Hackathon Activity Log + Judges' Feedback (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › In-Class Activity: Updated Resume (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Upwardly Global Learning Path: Marketing Yourself (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: LinkedIn Profile (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Elevator Pitch Video (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Upwardly Global Learning Path: Networking (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › In-Class Activity: Career Plan (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Weekly Job Applications & Networking (Due July 26) (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › (OPTIONAL) Homework: Weekly Job Applications & Networking (Due August 2) (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Upwardly Global Learning Path: Interview (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Career Class Option Selection (Due August 9) (Quiz)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › In-Class Activity: Application Questions (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Option 1 - Weekly Job Applications & Progress Report (Due August 23) (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Option 1 - Weekly Job Applications & Progress Report (Due August 30) (Assignment)", "[career] IF '25 NY Career Readiness and Success › Phase 2 (6/9-8/29) › Homework: Portfolio (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › March Program Satisfaction (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › April Program Satisfaction  (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › May Program Satisfaction (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › June Program Satisfaction  (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › July Program Satisfaction (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › August Program Satisfaction  (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › September Program Satisfaction (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › October Program Satisfaction  (Assignment)", "[career] IF '25 NY Career Readiness and Success › Monthly Program Satisfaction Surveys › November Program Satisfaction  (Assignment)"], "metas": [{"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 851, "module_name": "Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th)", "item_title": "Week 3 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/week-3-overview-2"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 851, "module_name": "Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th)", "item_title": "Week 3 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/week-3-overview-2"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 851, "module_name": "Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th)", "item_title": "W3D3: Introduction to Data Science", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w3d3-introduction-to-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 851, "module_name": "Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th)", "item_title": "W3D4:  First Steps in Programming", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w3d4-first-steps-in-programming"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 851, "module_name": "Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th)", "item_title": "[Discussion] W3D3 What do you want to use data science for?", "type": "Discussion"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 851, "module_name": "Week 3: Introduction to Data Science (Feb. 12th- Feb. 13th)", "item_title": "[TEX] W3D4 Programming Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 852, "module_name": "Week 4: Advanced Programming (Feb. 17th- Feb. 20th)", "item_title": "Week 4 Overview  ", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/week-4-overview"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 852, "module_name": "Week 4: Advanced Programming (Feb. 17th- Feb. 20th)", "item_title": "W4D2: Introduction to Programming", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w4d2-introduction-to-programming"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 852, "module_name": "Week 4: Advanced Programming (Feb. 17th- Feb. 20th)", "item_title": "W4D3: Introduction to Functions", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w4d3-introduction-to-functions"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 852, "module_name": "Week 4: Advanced Programming (Feb. 17th- Feb. 20th)", "item_title": "W4D4: Introduction to Functions II", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w4d4-introduction-to-functions-ii"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 852, "module_name": "Week 4: Advanced Programming (Feb. 17th- Feb. 20th)", "item_title": "[TEX] W4D2 Introduction to Programming Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 852, "module_name": "Week 4: Advanced Programming (Feb. 17th- Feb. 20th)", "item_title": "[TEX] W4D3 Introduction to Functions Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "Week 5 Overview   ", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/week-5-overview"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "W5D1:  Advanced Functions", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w5d1-advanced-functions"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "W5D2: Types of Experiments & Visualizing Data", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w5d2-types-of-experiments-and-visualizing-data"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "W5D3: Descriptive Statistics & Probability", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w5d3-descriptive-statistics-and-probability"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "W5D4: Intro to Data Analytics & Machine Learning", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/w5d4-intro-to-data-analytics-and-machine-learning"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "[TEX] W5D1 Advanced Functions Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "[TEX] W5D2 Types of Experiments & Visualizing Data Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "[TEX] W5D3 Descriptive Statistics & Probability Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "What is Data Science?", "type": "Page", "url": "https://tkh.instructure.com/courses/165/pages/what-is-data-science"}, {"domain": "technical", "course_id": 165, "course_name": "Foundations '25 Data Science", "module_id": 853, "module_name": "Week 5:  Statistics(Feb. 24th- Feb. 27th)", "item_title": "[TEX] Final Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "Week 1 Overview", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/week-1-overview"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D1: Getting Started", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d1-getting-started"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D1: Getting Started", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d1-getting-started"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D2: Learning How to Learn", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d2-learning-how-to-learn"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D2: Learning How to Learn", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d2-learning-how-to-learn"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D2: Learning How to Learn", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d2-learning-how-to-learn"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D3: Building Your Inner Compass (Motivation and Emotional Strength)", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d3-building-your-inner-compass-motivation-and-emotional-strength"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D3: Building Your Inner Compass (Motivation and Emotional Strength)", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d3-building-your-inner-compass-motivation-and-emotional-strength"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D4: The Productivity Toolkit", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d4-the-productivity-toolkit"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "W1D4: The Productivity Toolkit", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w1d4-the-productivity-toolkit"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D1) Before Class Onboarding Checklist", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D1) Before Class Mini Quiz: Foundations Onboarding Knowledge Check ", "type": "Quiz"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D1) After Class Assignment: Reflecting on Your Support System", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D2) Before Class Mini Quiz: Learning How to Learn Knowledge Check ", "type": "Quiz"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D2) After Class Assignment: Complete the VARK Questionnaire and Reflect on Your Learning Preferences", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D3) Before Class Exercise: Self Discovery Worksheet", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D3) After Class Assignment: Applying the DESC Model", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D4) Before Class Exercise: Write 3 SMART Goals ", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 843, "module_name": "Week 1: Foundations For Success (Jan. 27th-Jan. 30th)", "item_title": "(W1D4) After-Class Assignment: Time Blocking and SMART Planning", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "Week 2 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/week-2-overview"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "Week 2 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/week-2-overview"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "Week 2 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/week-2-overview"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D1: Paths and Possibilities", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d1-paths-and-possibilities"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D1: Paths and Possibilities", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d1-paths-and-possibilities"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D2: Track Exploration (Track Mini Lessons) ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d2-track-exploration-track-mini-lessons"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D2: Track Exploration (Track Mini Lessons) ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d2-track-exploration-track-mini-lessons"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D2: Track Exploration (Track Mini Lessons) ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d2-track-exploration-track-mini-lessons"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D2: Track Exploration (Track Mini Lessons) ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d2-track-exploration-track-mini-lessons"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D3: Track Exploration (Track Mini Lessons Continued)", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d3-track-exploration-track-mini-lessons-continued"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D3: Track Exploration (Track Mini Lessons Continued)", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d3-track-exploration-track-mini-lessons-continued"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D3: Track Exploration (Track Mini Lessons Continued)", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d3-track-exploration-track-mini-lessons-continued"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D3: Track Exploration (Track Mini Lessons Continued)", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d3-track-exploration-track-mini-lessons-continued"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D4: Meet the Industry Experts", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d4-meet-the-industry-experts"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D4: Meet the Industry Experts", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d4-meet-the-industry-experts"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "W2D4: Meet the Industry Experts", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w2d4-meet-the-industry-experts"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "(W2D1) After Class Assignment: Explore Your Preferred Track and Research Associated Roles", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "(W2D1) After Class Assignment: Prepare a Question for the Industry Panel Discussion", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 845, "module_name": "Week 2: Charting Your Path (Feb. 3rd- Feb 6th)", "item_title": "(W2D4) After Class Assignment: Track Preference Survey", "type": "Assignment"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 846, "module_name": "Week 3: Tech Essentials (Feb. 10th- Feb 13th)", "item_title": "Week 3 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/week-3-overview"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 846, "module_name": "Week 3: Tech Essentials (Feb. 10th- Feb 13th)", "item_title": "Week 3 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/week-3-overview"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 846, "module_name": "Week 3: Tech Essentials (Feb. 10th- Feb 13th)", "item_title": "Week 3 Overview ", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/week-3-overview"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 846, "module_name": "Week 3: Tech Essentials (Feb. 10th- Feb 13th)", "item_title": "W3D1: Mainframes to AI", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w3d1-mainframes-to-ai"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 846, "module_name": "Week 3: Tech Essentials (Feb. 10th- Feb 13th)", "item_title": "W3D1: Mainframes to AI", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w3d1-mainframes-to-ai"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 846, "module_name": "Week 3: Tech Essentials (Feb. 10th- Feb 13th)", "item_title": "W3D2: Shell Scripting", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w3d2-shell-scripting"}, {"domain": "technical", "course_id": 162, "course_name": "Foundations Course", "module_id": 846, "module_name": "Week 3: Tech Essentials (Feb. 10th- Feb 13th)", "item_title": "W3D2: Shell Scripting", "type": "Page", "url": "https://tkh.instructure.com/courses/162/pages/w3d2-shell-scripting"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Fellow Success Resources", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/fellow-success-resources"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Fellow Success Resources", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/fellow-success-resources"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Fellow Success Resources", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/fellow-success-resources"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Help Request Steps", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/help-request-template"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Help Request Steps", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/help-request-template"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Help Request Steps", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/help-request-template"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Culture Contract - Data Science", "type": "ExternalUrl", "url": "https://docs.google.com/document/d/15_ibCpU7lgvMpRNtFh5In6fBgRj-7xGKh13-VJ_kJ6U/edit?usp=sharing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "IF 25 DS Syllabus", "type": "ExternalUrl", "url": "https://docs.google.com/document/d/1XPcdVqqWs6lFGLcSvkZ4604QNUreO8m7QiuGJ88vKl8/edit?tab=t.0"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 953, "module_name": "Fellow Resources", "item_title": "Student Guide: Using External Code & AI Responsibly", "type": "ExternalUrl", "url": "https://docs.google.com/document/d/1rECLW7wpHFAcGXvdbFdqyF4oYl_uAFkC0PxbaCPi1hc/edit?tab=t.0#heading=h.lmp53jlanmmz"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "📚 P1W1 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w1-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "💻 W1D1 (3/10) (Re)-Introduction to Data Science", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d1-3-slash-10-re-introduction-to-data-science"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "💻 W1D1 (3/10) (Re)-Introduction to Data Science", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d1-3-slash-10-re-introduction-to-data-science"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "💻 W1D2 (3/11) Advanced Control Flow I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d2-3-slash-11-advanced-control-flow-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "💻 W1D2 (3/11) Advanced Control Flow I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d2-3-slash-11-advanced-control-flow-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "💻 W1D3 (3/12) Introduction to Data Processing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d3-3-slash-12-introduction-to-data-processing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "💻 W1D3 (3/12) Introduction to Data Processing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d3-3-slash-12-introduction-to-data-processing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "🤖 P1W1 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w1-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "[TLAB] Advanced Health Monitoring Analysis (Due 3/28)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 954, "module_name": "P1W1 (3/10-3/14) (Re)-Introduction to Data Science", "item_title": "Culture Contract - Data Science", "type": "ExternalUrl", "url": "https://docs.google.com/document/d/15_ibCpU7lgvMpRNtFh5In6fBgRj-7xGKh13-VJ_kJ6U/edit?usp=sharing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "📚 P1W2 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w2-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "💻 W2D1 (3/17) Introduction to Abstraction", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d1-3-slash-17-introduction-to-abstraction"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "💻 W2D1 (3/17) Introduction to Abstraction", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d1-3-slash-17-introduction-to-abstraction"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "💻 W2D2 (3/18) Advanced Abstraction", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d2-3-slash-18-advanced-abstraction"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "💻 W2D2 (3/18) Advanced Abstraction", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d2-3-slash-18-advanced-abstraction"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "🧪 W2D3 (3/19) Measures of Dispersion & The Central Limit Theorem", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d3-3-slash-19-measures-of-dispersion-and-the-central-limit-theorem"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "🧪 W2D3 (3/19) Measures of Dispersion & The Central Limit Theorem", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d3-3-slash-19-measures-of-dispersion-and-the-central-limit-theorem"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "🤖 P1W2 Post Class Summary ", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w2-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "[TQZ] Week 2 Pre-Class Content Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 955, "module_name": "P1W2 (3/17-3/21) Introduction to Abstraction", "item_title": "[TQZ] OOP Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "📚 P1W3 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w3-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "💻 W3D1 (3/24) Introduction to Conda Environments & File I/O Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d1-3-slash-24-introduction-to-conda-environments-and-file-i-slash-o-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "💻 W3D1 (3/24) Introduction to Conda Environments & File I/O Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d1-3-slash-24-introduction-to-conda-environments-and-file-i-slash-o-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "💻 W3D2 (3/25) Advanced Data Processing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d2-3-slash-25-advanced-data-processing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "💻 W3D2 (3/25) Advanced Data Processing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d2-3-slash-25-advanced-data-processing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "🧪 W3D3 (3/26) Data Visualizations Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d3-3-slash-26-data-visualizations-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "🧪 W3D3 (3/26) Data Visualizations Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d3-3-slash-26-data-visualizations-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "🤖 P1W3 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w3-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "[TQZ] Week 3 Pre-Class Content Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 956, "module_name": "P1W3 (3/24-3/28) Introduction to Data Processing", "item_title": "[TQZ] Statistics Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "📚 P1W4 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w4-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "💻 W4D1 (3/31) Applied REST APIs I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d1-3-slash-31-applied-rest-apis-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "💻 W4D1 (3/31) Applied REST APIs I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d1-3-slash-31-applied-rest-apis-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "💻 W4D2 (4/1) Applied REST APIs II ", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d2-4-slash-1-applied-rest-apis-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "💻 W4D2 (4/1) Applied REST APIs II ", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d2-4-slash-1-applied-rest-apis-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "🧪 W4D3 (4/2) Probability II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d3-4-slash-2-probability-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "🧪 W4D3 (4/2) Probability II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d3-4-slash-2-probability-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "🤖 P1W4 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w4-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "[TQZ] Week 4 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 957, "module_name": "P1W4 (3/31-4/4) Applied REST APIs", "item_title": "[TLAB] OpenAI API Review Auto-Evaluation (Due 4/21) ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "📚 P1W5 Overview & Lesson Plan ", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w5-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "💻 W5D1 (4/7) Applied Web Scraping I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d1-4-slash-7-applied-web-scraping-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "💻 W5D1 (4/7) Applied Web Scraping I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d1-4-slash-7-applied-web-scraping-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "💻 W5D2 (4/8) Applied Web Scraping II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d2-4-slash-8-applied-web-scraping-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "💻 W5D2 (4/8) Applied Web Scraping II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d2-4-slash-8-applied-web-scraping-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "🧪 W5D3 (4/9) Introduction to Hypothesis Testing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d3-4-slash-9-introduction-to-hypothesis-testing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "🧪 W5D3 (4/9) Introduction to Hypothesis Testing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d3-4-slash-9-introduction-to-hypothesis-testing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "🤖 P1W5 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w5-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 958, "module_name": "P1W5 (4/7-4/11) Applied Web Scraping", "item_title": "[TQZ] Week 5 Pre-Class Content Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "📚 P1W6 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w6-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "💻 W6D1 (4/14) Introduction to Data Analysis I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d1-4-slash-14-introduction-to-data-analysis-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "💻 W6D1 (4/14) Introduction to Data Analysis I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d1-4-slash-14-introduction-to-data-analysis-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "💻 W6D2 (4/15) Introduction to Data Analysis II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d2-4-slash-15-introduction-to-data-analysis-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "💻 W6D2 (4/15) Introduction to Data Analysis II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d2-4-slash-15-introduction-to-data-analysis-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "🧪 W6D3 (4/16) Data Reporting", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d3-4-slash-16-data-reporting"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "🧪 W6D3 (4/16) Data Reporting", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d3-4-slash-16-data-reporting"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "🤖 P1W6 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w6-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 959, "module_name": "P1W6 (4/14-4/18) Introduction to Data Analysis", "item_title": "[TQZ] Week 6 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "📚 P1W7 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w7-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "💻 W7D1 (4/21) Advanced Data Analysis I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d1-4-slash-21-advanced-data-analysis-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "💻 W7D1 (4/21) Advanced Data Analysis I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d1-4-slash-21-advanced-data-analysis-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "💻 W7D2 (4/22) Advanced Data Analysis II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d2-4-slash-22-advanced-data-analysis-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "💻 W7D2 (4/22) Advanced Data Analysis II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d2-4-slash-22-advanced-data-analysis-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "🧪 W7D3 (4/23) Pandas Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d3-4-slash-23-pandas-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "🧪 W7D3 (4/23) Pandas Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d3-4-slash-23-pandas-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "🤖 P1W7 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w7-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "[TQZ] Week 7 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 960, "module_name": "P1W7 (4/21-4/25) Advanced Data Analysis", "item_title": "[TLAB] Weather Data Analysis (Due 5/14)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "📚 P1W8 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w8-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "💻 W8D1 (4/28) Shopping Dataset Case Study", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d1-4-slash-28-shopping-dataset-case-study"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "💻 W8D1 (4/28) Shopping Dataset Case Study", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d1-4-slash-28-shopping-dataset-case-study"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "💻 W8D2 (4/29) Twitter Dataset Case Study", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d2-4-slash-29-twitter-dataset-case-study"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "💻 W8D2 (4/29) Twitter Dataset Case Study", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d2-4-slash-29-twitter-dataset-case-study"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "🧪 W8D3 (4/30) AB Testing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d3-4-slash-30-ab-testing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "🧪 W8D3 (4/30) AB Testing", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d3-4-slash-30-ab-testing"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "🤖 P1W8 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w8-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 961, "module_name": "P1W8 (4/28-5/2) Pandas Case Studies", "item_title": "[TQZ] Week 8 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "📚 P1W9 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w9-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "💻 W9D1 (5/5) Introduction to Structured Databases I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d1-5-slash-5-introduction-to-structured-databases-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "💻 W9D1 (5/5) Introduction to Structured Databases I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d1-5-slash-5-introduction-to-structured-databases-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "💻 W9D2 (5/6) Introduction to Structured Databases II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d2-5-slash-6-introduction-to-structured-databases-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "💻 W9D2 (5/6) Introduction to Structured Databases II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d2-5-slash-6-introduction-to-structured-databases-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "🧪 W9D3 (5/7) SQL Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d3-5-slash-7-sql-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "🧪 W9D3 (5/7) SQL Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d3-5-slash-7-sql-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "🤖 P1W9 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p1w9-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 962, "module_name": "P1W9  (5/5-5/9) Introduction to Structured Databases", "item_title": "[TQZ] Week 9 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "💻 W10D1 (5/12) Advanced SQL I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d1-5-slash-12-advanced-sql-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "💻 W10D1 (5/12) Advanced SQL I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d1-5-slash-12-advanced-sql-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "💻 W10D2 (5/13) Advanced SQL II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d2-5-slash-13-advanced-sql-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "💻 W10D2 (5/13) Advanced SQL II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d2-5-slash-13-advanced-sql-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "💻 W10D3 (5/14) SQL Review II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d3-5-slash-14-sql-review-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "💻 W10D3 (5/14) SQL Review II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d3-5-slash-14-sql-review-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "🧪 W10D4 (5/15) Intro to TEPP", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d4-5-slash-15-intro-to-tepp"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "🧪 W10D4 (5/15) Intro to TEPP", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d4-5-slash-15-intro-to-tepp"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 963, "module_name": "P1W10 (5/12-5/16) Advanced SQL ", "item_title": "[TEPP] Phase 1 Portfolio Project (Due 5/25)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 964, "module_name": "P1W11 (4/28 - 5/23) End of Phase Project", "item_title": "💻 W11D1 (5/19) Working Day I", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w11d1-5-slash-19-working-day-i"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 964, "module_name": "P1W11 (4/28 - 5/23) End of Phase Project", "item_title": "💻 W11D2 (5/20) Working Day II", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w11d2-5-slash-20-working-day-ii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 964, "module_name": "P1W11 (4/28 - 5/23) End of Phase Project", "item_title": "💻 W11D3 (5/21) Working Day III", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w11d3-5-slash-21-working-day-iii"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D1 (6/9) Introduction to Phase 2", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d1-6-slash-9-introduction-to-phase-2"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D1 (6/9) Introduction to Phase 2", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d1-6-slash-9-introduction-to-phase-2"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D2 (6/10) Advanced Python Refresher", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d2-6-slash-10-advanced-python-refresher"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D2 (6/10) Advanced Python Refresher", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d2-6-slash-10-advanced-python-refresher"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D3 (6/11) SQL Refresher", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d3-6-slash-11-sql-refresher"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D3 (6/11) SQL Refresher", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d3-6-slash-11-sql-refresher"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D4 (6/12) Introduction to Linear Regression", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d4-6-slash-12-introduction-to-linear-regression"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "💻 W1D4 (6/12) Introduction to Linear Regression", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w1d4-6-slash-12-introduction-to-linear-regression"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 965, "module_name": "P2W1 (6/9-6/13) Python & SQL Review", "item_title": "[TLAB] SQL Ad-Hoc Analysis (Due 6/27)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "📚 P2W2 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w2-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "💻 W2D2 (6/17) Introduction to Error & Regularization", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d2-6-slash-17-introduction-to-error-and-regularization"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "💻 W2D2 (6/17) Introduction to Error & Regularization", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d2-6-slash-17-introduction-to-error-and-regularization"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "💻 W2D3 (6/18) Hyperparameter Tuning", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d3-6-slash-18-hyperparameter-tuning"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "💻 W2D3 (6/18) Hyperparameter Tuning", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w2d3-6-slash-18-hyperparameter-tuning"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "🤖 P2W2 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w2-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "[TQZ] P2W2 Pre-Class Content Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 966, "module_name": "P2W2 (6/16-6/20) Introduction to Machine Learning", "item_title": "[TLAB] SQL Ad-Hoc Analysis Checkpoint (Due 6/20)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "📚 P2W3 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w3-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "📚 P2W3 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w3-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "💻 W3D1 (6/23) Introduction to Logistic Regression", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d1-6-slash-23-introduction-to-logistic-regression"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "💻 W3D1 (6/23) Introduction to Logistic Regression", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d1-6-slash-23-introduction-to-logistic-regression"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "💻 W3D1 (6/23) Introduction to Logistic Regression", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d1-6-slash-23-introduction-to-logistic-regression"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "💻 W3D2 (6/24) Logistic Regression Accuracy Metrics", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d2-6-slash-24-logistic-regression-accuracy-metrics"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "💻 W3D2 (6/24) Logistic Regression Accuracy Metrics", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d2-6-slash-24-logistic-regression-accuracy-metrics"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "💻 W3D3 (6/25) Linear & Logistic Regression Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d3-6-slash-25-linear-and-logistic-regression-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "💻 W3D3 (6/25) Linear & Logistic Regression Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w3d3-6-slash-25-linear-and-logistic-regression-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "🤖 P2W3 Post Class Summary", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w3-post-class-summary"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 967, "module_name": "P2W3 (6/23-6/27) Classification Algorithms", "item_title": "[TQZ] P2W3 Pre-Class Content Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 968, "module_name": "P2W4 (6/30-7/3) Bayes Theorem", "item_title": "💻 W4D3 (7/2) Bayes Theorem Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d3-7-slash-2-bayes-theorem-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 968, "module_name": "P2W4 (6/30-7/3) Bayes Theorem", "item_title": "💻 W4D3 (7/2) Bayes Theorem Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d3-7-slash-2-bayes-theorem-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 968, "module_name": "P2W4 (6/30-7/3) Bayes Theorem", "item_title": "💻 W4D3 (7/2) Bayes Theorem Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w4d3-7-slash-2-bayes-theorem-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 968, "module_name": "P2W4 (6/30-7/3) Bayes Theorem", "item_title": "[TLAB] Financial Fraud Detection (Due 7/23)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "📚 P2W5 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w5-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "💻 W5D1 (7/7) Naive Bayes Classifier", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d1-7-slash-7-naive-bayes-classifier"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "💻 W5D1 (7/7) Naive Bayes Classifier", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d1-7-slash-7-naive-bayes-classifier"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "💻 W5D1 (7/7) Naive Bayes Classifier", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d1-7-slash-7-naive-bayes-classifier"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "💻 W5D2 (7/8) K Nearest Neighbors", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d2-7-slash-8-k-nearest-neighbors"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "💻 W5D2 (7/8) K Nearest Neighbors", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d2-7-slash-8-k-nearest-neighbors"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "💻 W5D3 (7/9) Feature Engineering", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d3-7-slash-9-feature-engineering"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "💻 W5D3 (7/9) Feature Engineering", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w5d3-7-slash-9-feature-engineering"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "[TQZ] P2W5 Pre-Class Content Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 969, "module_name": "P2W5 (7/7-7/11) Advanced Classification", "item_title": "[TLAB] Financial Fraud Detection Checkpoint #1 (Due 7/9)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "📚 P2W6 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w6-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "💻 W6D1 (7/14) Support Vector Machines", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d1-7-slash-14-support-vector-machines"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "💻 W6D1 (7/14) Support Vector Machines", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d1-7-slash-14-support-vector-machines"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "💻 W6D2 (7/15) Decision Trees", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d2-7-slash-15-decision-trees"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "💻 W6D2 (7/15) Decision Trees", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d2-7-slash-15-decision-trees"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "💻 W6D3 (7/16) Bagging & Boosting Trees", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d3-7-slash-16-bagging-and-boosting-trees"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "💻 W6D3 (7/16) Bagging & Boosting Trees", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w6d3-7-slash-16-bagging-and-boosting-trees"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "[TQZ] P2W6 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "[Mini TLAB] Machine Learning Competition Lab on Customer Churn (Due 7/19)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 970, "module_name": "P2W6 (7/14-7/18) Advanced Classification II", "item_title": "[TLAB] Financial Fraud Detection Checkpoint #2 (Due 7/18)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "📚 P2W7 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w7-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "💻 W7D1 (7/21) Machine Learning Case Study & Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d1-7-slash-21-machine-learning-case-study-and-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "💻 W7D1 (7/21) Machine Learning Case Study & Review", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d1-7-slash-21-machine-learning-case-study-and-review"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "💻 W7D3 (7/23) Unsupervised Learning Algorithms", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d3-7-slash-23-unsupervised-learning-algorithms"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "💻 W7D3 (7/23) Unsupervised Learning Algorithms", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d3-7-slash-23-unsupervised-learning-algorithms"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "💻 W7D3 (7/23) Unsupervised Learning Algorithms", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w7d3-7-slash-23-unsupervised-learning-algorithms"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "[TQZ] P2W7 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 971, "module_name": "P2W7 (7/21-7/25) Unsupervised Learning", "item_title": "[Mini TLAB] Machine Learning Code-Along (Due 7/22)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "📚 P2W8 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w8-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "📚 P2W8 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w8-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "📚 P2W8 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w8-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "💻 W8D1 (7/28) Dimensionality Reduction", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d1-7-slash-28-dimensionality-reduction"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "💻 W8D1 (7/28) Dimensionality Reduction", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d1-7-slash-28-dimensionality-reduction"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "💻 W8D1 (7/28) Dimensionality Reduction", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d1-7-slash-28-dimensionality-reduction"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "💻 W8D2 (7/29) Introduction to Neural Networks", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d2-7-slash-29-introduction-to-neural-networks"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "💻 W8D2 (7/29) Introduction to Neural Networks", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d2-7-slash-29-introduction-to-neural-networks"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "💻 W8D3 (7/30) Keras Lab Session", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d3-7-slash-30-keras-lab-session"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "💻 W8D3 (7/30) Keras Lab Session", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w8d3-7-slash-30-keras-lab-session"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 972, "module_name": "P2W8 (7/28 - 8/1) Introduction to Neural Networks", "item_title": "[TQZ] P2W8 Pre-Class Content Quiz", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "📚 P2W9 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w9-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "📚 P2W9 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w9-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "📚 P2W9 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w9-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "📚 P2W9 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w9-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "📚 P2W9 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w9-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "💻 W9D1 (8/4) Vector Embeddings", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d1-8-slash-4-vector-embeddings"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "💻 W9D1 (8/4) Vector Embeddings", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d1-8-slash-4-vector-embeddings"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "💻 W9D2 (8/5) Transformer Architecture", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d2-8-slash-5-transformer-architecture"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "💻 W9D2 (8/5) Transformer Architecture", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d2-8-slash-5-transformer-architecture"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "💻 W9D3 (8/6) HuggingFace Pipeline", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d3-8-slash-6-huggingface-pipeline"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "💻 W9D3 (8/6) HuggingFace Pipeline", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w9d3-8-slash-6-huggingface-pipeline"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "[TQZ] P2W9 Pre-Class Content Quiz ", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 973, "module_name": "P2W9 (8/4-8/8) NLP Foundations & Transformers", "item_title": "[Mini TLAB] Music Recommendation Lab (Due 8/9)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "📚 P2W10 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w10-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "📚 P2W10 Overview & Lesson Plan", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/p2w10-overview-and-lesson-plan"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "💻 W10D1 (8/11) Vector Databases & Retrieval Augmented Generation (RAGs)", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d1-8-slash-11-vector-databases-and-retrieval-augmented-generation-rags"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "💻 W10D1 (8/11) Vector Databases & Retrieval Augmented Generation (RAGs)", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d1-8-slash-11-vector-databases-and-retrieval-augmented-generation-rags"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "💻 W10D2 (8/12) Fine-Tuning", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d2-8-slash-12-fine-tuning"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "💻 W10D2 (8/12) Fine-Tuning", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d2-8-slash-12-fine-tuning"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "💻 W10D3 (8/13) AI Tools Case-Study", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d3-8-slash-13-ai-tools-case-study"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "💻 W10D3 (8/13) AI Tools Case-Study", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d3-8-slash-13-ai-tools-case-study"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "[W10D4] Important Reminder: Prometheus Capstone Info Session", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d4-important-reminder-prometheus-capstone-info-session"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "[W10D4] Important Reminder: Prometheus Capstone Info Session", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d4-important-reminder-prometheus-capstone-info-session"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "[W10D4] Important Reminder: Prometheus Capstone Info Session", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d4-important-reminder-prometheus-capstone-info-session"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "[W10D4] Important Reminder: Prometheus Capstone Info Session", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w10d4-important-reminder-prometheus-capstone-info-session"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 974, "module_name": "P2W10 (8/11-8/15) Applied LLM Techniques", "item_title": "Prometheus Interest Form: Due August 21st", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 975, "module_name": "P2W11 (8/18-8/22) Agents & End of Phase Project", "item_title": "💻 W11D1 (8/18) Applied LLM Review & AI Agents", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w11d1-8-slash-18-applied-llm-review-and-ai-agents"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 975, "module_name": "P2W11 (8/18-8/22) Agents & End of Phase Project", "item_title": "💻 W11D1 (8/18) Applied LLM Review & AI Agents", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w11d1-8-slash-18-applied-llm-review-and-ai-agents"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 975, "module_name": "P2W11 (8/18-8/22) Agents & End of Phase Project", "item_title": "💻 W11D2 (8/19) TEPP Working Day 1", "type": "Page", "url": "https://tkh.instructure.com/courses/172/pages/w11d2-8-slash-19-tepp-working-day-1"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 975, "module_name": "P2W11 (8/18-8/22) Agents & End of Phase Project", "item_title": "[TEPP] Phase 2 Portfolio Project (Due 8/29)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 975, "module_name": "P2W11 (8/18-8/22) Agents & End of Phase Project", "item_title": "[TEPP] Phase 2 Portfolio Project Checkpoint #1 (Due 8/20)", "type": "Assignment"}, {"domain": "technical", "course_id": 172, "course_name": "IF '25 Data Science Cohort A", "module_id": 976, "module_name": "P2W12 (8/25 - 8/29) End of Phase Project Week", "item_title": "[TEPP] Phase 2 Portfolio Project Checkpoint #2 (Due 8/27)", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1118, "module_name": "Fellow Resources", "item_title": "Fellow Success Resources", "type": "Page", "url": "https://tkh.instructure.com/courses/181/pages/fellow-success-resources"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1118, "module_name": "Fellow Resources", "item_title": "Fellow Success Resources", "type": "Page", "url": "https://tkh.instructure.com/courses/181/pages/fellow-success-resources"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1118, "module_name": "Fellow Resources", "item_title": "Fellow Success Resources", "type": "Page", "url": "https://tkh.instructure.com/courses/181/pages/fellow-success-resources"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Option 1 - Weekly Job Applications & Progress Report (Due August 30)", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Watch Hackathon Video", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Upwardly Global Learning Paths: Tech Market/Resume/Cover Letter", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Draft Resume", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Hackathon Activity Log + Judges' Feedback", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "In-Class Activity: Updated Resume", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Upwardly Global Learning Path: Marketing Yourself", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: LinkedIn Profile", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Elevator Pitch Video", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Upwardly Global Learning Path: Networking", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "In-Class Activity: Career Plan", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Weekly Job Applications & Networking (Due July 26)", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "(OPTIONAL) Homework: Weekly Job Applications & Networking (Due August 2)", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Upwardly Global Learning Path: Interview", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Career Class Option Selection (Due August 9)", "type": "Quiz"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "In-Class Activity: Application Questions", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Option 1 - Weekly Job Applications & Progress Report (Due August 23)", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Option 1 - Weekly Job Applications & Progress Report (Due August 30)", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1239, "module_name": "Phase 2 (6/9-8/29)", "item_title": "Homework: Portfolio", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "March Program Satisfaction", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "April Program Satisfaction ", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "May Program Satisfaction", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "June Program Satisfaction ", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "July Program Satisfaction", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "August Program Satisfaction ", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "September Program Satisfaction", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "October Program Satisfaction ", "type": "Assignment"}, {"domain": "career", "course_id": 181, "course_name": "IF '25 NY Career Readiness and Success", "module_id": 1222, "module_name": "Monthly Program Satisfaction Surveys", "item_title": "November Program Satisfaction ", "type": "Assignment"}]}